[
    {
        "word": "Agitate",
        "part_of_speech": "Verb",
        "definition": "To make someone troubled or nervous; to stir or disturb something, especially a liquid.",
        "hindi_meaning": "उत्तेजित करना, परेशान करना",
        "mnemonic": "Agitate sounds like 'ag-itate,' as if something is irritating or stirring up trouble.",
        "visual_representation": "Picture someone shaking a bottle of liquid, causing it to froth and bubble, symbolizing agitation.",
        "example_sentence": "The controversial speech agitated the crowd, leading to a heated debate."
    },
    {
        "word": "Bravado",
        "part_of_speech": "Noun",
        "definition": "A bold manner or a show of boldness intended to impress or intimidate.",
        "hindi_meaning": "शेख़ी, बहादुरी का दिखावा",
        "mnemonic": "Bravado sounds like 'brave-do,' indicating someone trying to appear brave or show off.",
        "visual_representation": "Imagine someone acting tough and fearless in front of others, but it’s just a facade, symbolizing bravado.",
        "example_sentence": "His bravado in front of the audience was merely a cover for his nervousness."
    },
    {
        "word": "Circumlocution",
        "part_of_speech": "Noun",
        "definition": "The use of many words where fewer would do, especially in a deliberate attempt to be vague or evasive.",
        "hindi_meaning": "घुमावदार बात, घुमा-फिराकर कहना",
        "mnemonic": "Circumlocution sounds like 'circle-locution,' indicating talking in circles or being indirect.",
        "visual_representation": "Picture someone talking in circles, avoiding getting to the point, symbolizing circumlocution.",
        "example_sentence": "The politician’s circumlocution made it hard to understand his true position on the issue."
    },
    {
        "word": "Detraction",
        "part_of_speech": "Noun",
        "definition": "The act of taking away from the worth or value of something; belittling or disparaging.",
        "hindi_meaning": "अपमान, निंदा",
        "mnemonic": "Detraction sounds like 'de-traction,' as if pulling down or diminishing something’s value.",
        "visual_representation": "Imagine someone pulling down a statue, symbolizing the act of belittling or detracting from its value.",
        "example_sentence": "The constant detraction of his achievements began to affect his confidence."
    },
    {
        "word": "Equity",
        "part_of_speech": "Noun",
        "definition": "Fairness and justice in the way people are treated; the value of shares issued by a company.",
        "hindi_meaning": "समानता, न्याय; इक्विटी",
        "mnemonic": "Equity sounds like 'equal-ity,' indicating fairness and justice.",
        "visual_representation": "Picture a balanced scale representing fairness and equal treatment, symbolizing equity.",
        "example_sentence": "The company strives for equity in all its employment practices."
    },
    {
        "word": "Fracas",
        "part_of_speech": "Noun",
        "definition": "A noisy disturbance or quarrel.",
        "hindi_meaning": "झगड़ा, हंगामा",
        "mnemonic": "Fracas sounds like 'fry-cuss,' indicating a heated argument or fight.",
        "visual_representation": "Imagine a loud, chaotic brawl in a crowded place, symbolizing a fracas.",
        "example_sentence": "A fracas broke out in the bar after someone made an insulting remark."
    },
    {
        "word": "Gingerly",
        "part_of_speech": "Adverb / Adjective",
        "definition": "In a careful or cautious manner.",
        "hindi_meaning": "सावधानीपूर्वक, सतर्कतापूर्वक",
        "mnemonic": "Gingerly sounds like 'ginger-ly,' as if handling something as delicately as ginger.",
        "visual_representation": "Picture someone tiptoeing across a creaky floor to avoid making noise, symbolizing gingerly movement.",
        "example_sentence": "She gingerly placed the fragile vase on the shelf."
    },
    {
        "word": "Hurtle",
        "part_of_speech": "Verb",
        "definition": "To move or cause to move at a great speed, typically in a wildly uncontrolled manner.",
        "hindi_meaning": "तेज़ी से भागना, धक्का देना",
        "mnemonic": "Hurtle sounds like 'hurl-tle,' indicating throwing or moving something rapidly.",
        "visual_representation": "Imagine a car speeding down a hill out of control, symbolizing hurtling.",
        "example_sentence": "The rock hurtled down the mountain, barely missing the hikers."
    },
    {
        "word": "Incur",
        "part_of_speech": "Verb",
        "definition": "To become subject to (something unwelcome or unpleasant) as a result of one's own behavior or actions.",
        "hindi_meaning": "झेलना, सामना करना",
        "mnemonic": "Incur sounds like 'in-cure,' as if bringing something upon oneself, whether good or bad.",
        "visual_representation": "Picture someone facing the consequences of their actions, symbolizing incurring something.",
        "example_sentence": "By failing to meet the deadline, the company incurred a hefty penalty."
    },
    {
        "word": "Luminary",
        "part_of_speech": "Noun",
        "definition": "A person who inspires or influences others, especially one prominent in a particular sphere; a natural light-giving body, especially the sun or moon.",
        "hindi_meaning": "प्रकाशमान व्यक्ति, प्रतिभावान व्यक्ति",
        "mnemonic": "Luminary sounds like 'luminous,' indicating someone who shines brightly or leads the way.",
        "visual_representation": "Picture a bright star in the sky that stands out among the others, symbolizing a luminary.",
        "example_sentence": "She was considered a luminary in the field of medicine."
    },
    {
        "word": "Modulate",
        "part_of_speech": "Verb",
        "definition": "To adjust or regulate the degree, pitch, or tone of something; to exert a modifying or controlling influence on.",
        "hindi_meaning": "समायोजित करना, परिवर्तन करना",
        "mnemonic": "Modulate sounds like 'mod-you-late,' indicating adjusting or modifying something, like tuning a radio.",
        "visual_representation": "Picture someone adjusting the volume knob on a stereo to achieve the perfect sound, symbolizing modulation.",
        "example_sentence": "The singer was able to modulate her voice to reach the high notes."
    },
    {
        "word": "Onus",
        "part_of_speech": "Noun",
        "definition": "Used to refer to something that is one's duty or responsibility.",
        "hindi_meaning": "जिम्मेदारी, भार",
        "mnemonic": "Onus sounds like 'own-us,' indicating something that is your own responsibility.",
        "visual_representation": "Picture a heavy weight being carried on someone's shoulders, symbolizing the burden of responsibility.",
        "example_sentence": "The onus is on the student to complete their homework on time."
    },
    {
        "word": "Phobia",
        "part_of_speech": "Noun",
        "definition": "An extreme or irrational fear of or aversion to something.",
        "hindi_meaning": "डर, भय",
        "mnemonic": "Phobia sounds like 'foe-bia,' indicating an enemy or something feared.",
        "visual_representation": "Picture someone terrified at the sight of a spider, symbolizing arachnophobia (a common phobia).",
        "example_sentence": "She has a phobia of heights and avoids tall buildings."
    },
    {
        "word": "Reprimand",
        "part_of_speech": "Noun / Verb",
        "definition": "A formal expression of disapproval; to rebuke someone, especially officially.",
        "hindi_meaning": "फटकार, डांटना",
        "mnemonic": "Reprimand sounds like 'rep-ri-mand,' as if someone is being sharply scolded.",
        "visual_representation": "Picture a boss scolding an employee for a mistake, symbolizing a reprimand.",
        "example_sentence": "The officer received a reprimand for his unprofessional conduct."
    },
    {
        "word": "Slander",
        "part_of_speech": "Noun / Verb",
        "definition": "The action or crime of making a false spoken statement damaging to a person's reputation.",
        "hindi_meaning": "बदनाम करना, मिथ्या कलंक",
        "mnemonic": "Slander sounds like 's-land-er,' as if someone is being dragged through the mud with lies.",
        "visual_representation": "Picture someone spreading harmful lies about another person, damaging their reputation, symbolizing slander.",
        "example_sentence": "He sued the newspaper for slander after they published false statements about him."
    },
    {
        "word": "Tryst",
        "part_of_speech": "Noun",
        "definition": "A private, romantic rendezvous between lovers.",
        "hindi_meaning": "गुप्त मुलाकात, प्रेम मिलन",
        "mnemonic": "Tryst sounds like 'try-‘st,' as if trying to meet secretly.",
        "visual_representation": "Picture a couple meeting in a secluded garden at night, symbolizing a tryst.",
        "example_sentence": "The lovers arranged a secret tryst in the park."
    },
    {
        "word": "Verve",
        "part_of_speech": "Noun",
        "definition": "Vigor, enthusiasm, or energy.",
        "hindi_meaning": "जोश, उत्साह",
        "mnemonic": "Verve sounds like 'nerve,' indicating energy, courage, or enthusiasm.",
        "visual_representation": "Picture a performer on stage giving an energetic and enthusiastic performance, symbolizing verve.",
        "example_sentence": "The artist’s verve was evident in every brushstroke of her painting."
    }
]
