[
    {
        "word": "Address",
        "part_of_speech": "Verb / Noun",
        "definition": "To speak to someone, typically in a formal manner; the details of the place where someone lives or an organization is situated.",
        "hindi_meaning": "संबोधित करना, पता",
        "mnemonic": "Address sounds like 'add rest,' as in guiding someone to rest at a place, or speaking to them formally.",
        "visual_representation": "Picture a person giving a formal speech at a podium, symbolizing addressing an audience.",
        "example_sentence": "The CEO addressed the concerns of the employees in his speech."
    },
    {
        "word": "Billowing",
        "part_of_speech": "Adjective / Verb",
        "definition": "Swelling, fluttering, or waving, typically of fabric or smoke.",
        "hindi_meaning": "फहराना, लहराना",
        "mnemonic": "Billowing sounds like 'bellowing,' as in something swelling and flowing outward like a loud noise.",
        "visual_representation": "Imagine a large curtain or flag swelling in the wind, symbolizing billowing.",
        "example_sentence": "The smoke was billowing from the factory chimney, rising high into the sky."
    },
    {
        "word": "Centurion",
        "part_of_speech": "Noun",
        "definition": "A commander of a century in the ancient Roman army, typically commanding 100 soldiers.",
        "hindi_meaning": "सेनापति, शतपति",
        "mnemonic": "Centurion sounds like 'century on,' indicating a leader of a century of soldiers.",
        "visual_representation": "Picture a Roman soldier in armor, leading a group of soldiers, symbolizing a centurion.",
        "example_sentence": "The centurion led his men with discipline and courage into battle."
    },
    {
        "word": "Demure",
        "part_of_speech": "Adjective",
        "definition": "Reserved, modest, and shy.",
        "hindi_meaning": "संकोची, विनम्र",
        "mnemonic": "Demure sounds like 'de-mirror,' as in someone who is shy and modest, avoiding attention.",
        "visual_representation": "Imagine a young woman with downcast eyes, blushing slightly, symbolizing demure behavior.",
        "example_sentence": "She gave a demure smile when complimented, not used to the attention."
    },
    {
        "word": "Enigma",
        "part_of_speech": "Noun",
        "definition": "A person or thing that is mysterious, puzzling, or difficult to understand.",
        "hindi_meaning": "पहेली, रहस्य",
        "mnemonic": "Enigma sounds like 'in a game,' where you have to solve a mystery or puzzle.",
        "visual_representation": "Picture a mysterious figure in the shadows, difficult to figure out, symbolizing an enigma.",
        "example_sentence": "The origin of the ancient manuscript remains an enigma to scholars."
    },
    {
        "word": "Flora",
        "part_of_speech": "Noun",
        "definition": "The plants of a particular region, habitat, or geological period.",
        "hindi_meaning": "वनस्पति, पौधे",
        "mnemonic": "Flora sounds like 'flower,' relating to the plants and vegetation in an area.",
        "visual_representation": "Imagine a lush forest full of diverse plant life, symbolizing flora.",
        "example_sentence": "The Amazon rainforest is known for its rich and diverse flora."
    },
    {
        "word": "Gratify",
        "part_of_speech": "Verb",
        "definition": "To give pleasure or satisfaction to someone.",
        "hindi_meaning": "प्रसन्न करना, संतुष्ट करना",
        "mnemonic": "Gratify sounds like 'greatify,' as in making someone feel great or satisfied.",
        "visual_representation": "Picture someone smiling with satisfaction after receiving a compliment, symbolizing gratification.",
        "example_sentence": "The praise from her teacher gratified her efforts and hard work."
    },
    {
        "word": "Heresy",
        "part_of_speech": "Noun",
        "definition": "Belief or opinion contrary to orthodox religious doctrine; an opinion profoundly at odds with what is generally accepted.",
        "hindi_meaning": "विधर्म, प्रचलित विश्वास के विरुद्ध विचार",
        "mnemonic": "Heresy sounds like 'hearsay,' indicating something spoken against established beliefs.",
        "visual_representation": "Imagine someone being shunned by a community for holding a controversial belief, symbolizing heresy.",
        "example_sentence": "His scientific ideas were considered heresy by the religious authorities of the time."
    },
    {
        "word": "Inanimate",
        "part_of_speech": "Adjective",
        "definition": "Not alive, especially not in the manner of animals and humans; lacking consciousness or life.",
        "hindi_meaning": "निर्जीव, बेजान",
        "mnemonic": "Inanimate sounds like 'in-animal,' indicating something that is not alive like an animal.",
        "visual_representation": "Picture a rock or a statue, lifeless and unmoving, symbolizing something inanimate.",
        "example_sentence": "The robot, though lifelike, remained an inanimate object."
    },
    {
        "word": "Lull",
        "part_of_speech": "Verb / Noun",
        "definition": "To calm or send to sleep, typically with soothing sounds or movements; a temporary interval of quiet or lack of activity.",
        "hindi_meaning": "शांति, धीमी गति",
        "mnemonic": "Lull sounds like 'lullaby,' a song to calm someone, usually a child, to sleep.",
        "visual_representation": "Imagine a mother gently rocking her baby to sleep, singing softly, symbolizing a lull.",
        "example_sentence": "There was a brief lull in the storm, giving the crew time to make repairs."
    },
    {
        "word": "Metaphysical",
        "part_of_speech": "Adjective",
        "definition": "Relating to metaphysics (a branch of philosophy dealing with the fundamental nature of reality and existence); abstract or theoretical.",
        "hindi_meaning": "पराभौतिक, अमूर्त",
        "mnemonic": "Metaphysical sounds like 'meta-physical,' indicating something beyond the physical, abstract.",
        "visual_representation": "Picture someone deep in thought, pondering the nature of existence and reality, symbolizing metaphysical ideas.",
        "example_sentence": "The poem explored metaphysical themes, questioning the nature of reality and existence."
    },
    {
        "word": "Nefarious",
        "part_of_speech": "Adjective",
        "definition": "Wicked or criminal, typically describing actions or activities.",
        "hindi_meaning": "दुष्ट, घृणित",
        "mnemonic": "Nefarious sounds like 'no-fair-ious,' indicating something unfairly wicked or evil.",
        "visual_representation": "Imagine a villain plotting an evil scheme, symbolizing something nefarious.",
        "example_sentence": "The police uncovered the criminal’s nefarious plot to rob the bank."
    },
    {
        "word": "Outstrip",
        "part_of_speech": "Verb",
        "definition": "To move faster than and overtake someone; to exceed or surpass.",
        "hindi_meaning": "पीछे छोड़ना, आगे निकल जाना",
        "mnemonic": "Outstrip sounds like 'out-strip,' as in to strip someone of their lead by going ahead.",
        "visual_representation": "Picture a runner sprinting past competitors in a race, symbolizing outstripping them.",
        "example_sentence": "The new technology allowed the company to outstrip its competitors quickly."
    },
    {
        "word": "Perceptive",
        "part_of_speech": "Adjective",
        "definition": "Having or showing sensitive insight or understanding.",
        "hindi_meaning": "सूझबूझ वाला, तीक्ष्ण",
        "mnemonic": "Perceptive sounds like 'perceive,' indicating someone who perceives or understands things quickly.",
        "visual_representation": "Imagine someone noticing subtle details that others miss, symbolizing perceptiveness.",
        "example_sentence": "Her perceptive analysis of the situation helped the team make the right decision."
    },
    {
        "word": "Relegate",
        "part_of_speech": "Verb",
        "definition": "To assign an inferior rank or position to someone or something.",
        "hindi_meaning": "पदावनत करना, निम्न स्तर पर भेजना",
        "mnemonic": "Relegate sounds like 'relocate to gate,' as in moving someone to a lower or less important position.",
        "visual_representation": "Picture a player being sent to the bench, away from the main action, symbolizing relegation.",
        "example_sentence": "After the mistake, he was relegated to a less important role in the project."
    },
    {
        "word": "Serenity",
        "part_of_speech": "Noun",
        "definition": "The state of being calm, peaceful, and untroubled.",
        "hindi_meaning": "शांति, शीतलता",
        "mnemonic": "Serenity sounds like 'serene tea,' as if drinking tea in a peaceful garden brings calmness.",
        "visual_representation": "Imagine a tranquil lake at dawn with mist rising gently, symbolizing serenity.",
        "example_sentence": "The serenity of the countryside was a welcome change from the chaos of the city."
    },
    {
        "word": "Tout",
        "part_of_speech": "Verb",
        "definition": "To attempt to sell something, typically by pestering people in an aggressive or bold manner; to promote or praise energetically.",
        "hindi_meaning": "बढ़ा-चढ़ाकर पेश करना, जमकर प्रचार करना",
        "mnemonic": "Tout sounds like 'shout out,' as in aggressively promoting or selling something.",
        "visual_representation": "Picture a salesperson loudly advertising a product to passersby, symbolizing touting.",
        "example_sentence": "The company began to tout its new product as the best on the market."
    },
    {
        "word": "Underlying",
        "part_of_speech": "Adjective",
        "definition": "Lying beneath or at the foundation of something; fundamental or basic.",
        "hindi_meaning": "आधारभूत, नींव के नीचे",
        "mnemonic": "Underlying sounds like 'under lying,' indicating something that lies beneath or forms the basis of something.",
        "visual_representation": "Imagine the roots of a tree hidden underground, providing support, symbolizing underlying factors.",
        "example_sentence": "The underlying cause of the problem was a lack of communication."
    },
    {
        "word": "Voluptuous",
        "part_of_speech": "Adjective",
        "definition": "Relating to or characterized by luxury or sensual pleasure; (of a woman’s body) curvaceous and sexually attractive.",
        "hindi_meaning": "विलासितापूर्ण, रसीला",
        "mnemonic": "Voluptuous sounds like 'volume plus,' indicating something full and luxurious.",
        "visual_representation": "Picture a richly decorated room filled with luxurious fabrics and furniture, symbolizing voluptuousness.",
        "example_sentence": "The actress was known for her voluptuous figure and glamorous style."
    },
    {
        "word": "Whimsical",
        "part_of_speech": "Adjective",
        "definition": "Playfully quaint or fanciful, especially in an appealing and amusing way; unpredictable.",
        "hindi_meaning": "विचित्र, कल्पनाशील",
        "mnemonic": "Whimsical sounds like 'whim cycle,' indicating something that changes on a whim, or is fanciful.",
        "visual_representation": "Imagine a child’s room decorated with playful, quirky designs, symbolizing whimsicality.",
        "example_sentence": "The artist’s whimsical style made her paintings unique and fun to look at."
    }
]
