[
    {
        "word": "Adulation",
        "part_of_speech": "Noun",
        "definition": "Excessive admiration or praise.",
        "hindi_meaning": "चापलूसी, अत्यधिक प्रशंसा",
        "mnemonic": "Adulation sounds like 'add-u-lation,' as in adding a lot of praise or flattery.",
        "visual_representation": "Picture a celebrity receiving overwhelming praise and admiration from fans, symbolizing adulation.",
        "example_sentence": "The actor basked in the adulation of his fans after the premiere of his new movie."
    },
    {
        "word": "Bleak",
        "part_of_speech": "Adjective",
        "definition": "Lacking vegetation and exposed to the elements; cold and miserable; not hopeful or encouraging.",
        "hindi_meaning": "उदासीन, निराशाजनक",
        "mnemonic": "Bleak sounds like 'bleak weather,' indicating something cold, desolate, or hopeless.",
        "visual_representation": "Imagine a desolate, wintry landscape with bare trees and gray skies, symbolizing bleakness.",
        "example_sentence": "The future looked bleak for the company after the loss of its biggest client."
    },
    {
        "word": "Chagrin",
        "part_of_speech": "Noun / Verb",
        "definition": "Distress or embarrassment at having failed or been humiliated; to feel distressed or humiliated.",
        "hindi_meaning": "निराशा, खिन्नता",
        "mnemonic": "Chagrin sounds like 'shag-rin,' indicating a feeling of shame or regret, like a painful grin.",
        "visual_representation": "Picture someone blushing with embarrassment after making a mistake in front of a crowd, symbolizing chagrin.",
        "example_sentence": "Much to his chagrin, he realized he had forgotten his lines during the performance."
    },
    {
        "word": "Deploy",
        "part_of_speech": "Verb",
        "definition": "To move troops or equipment into position for military action; to bring into effective action.",
        "hindi_meaning": "तैनात करना, व्यवस्थित करना",
        "mnemonic": "Deploy sounds like 'deploy troops,' indicating the positioning or arranging of forces.",
        "visual_representation": "Picture soldiers being strategically placed on a battlefield, symbolizing deployment.",
        "example_sentence": "The general decided to deploy additional troops to strengthen the defense."
    },
    {
        "word": "Enthrall",
        "part_of_speech": "Verb",
        "definition": "To capture the fascinated attention of.",
        "hindi_meaning": "मंत्रमुग्ध करना, मोहित करना",
        "mnemonic": "Enthrall sounds like 'in-thrall,' indicating being completely captivated or fascinated.",
        "visual_representation": "Picture an audience completely absorbed by a captivating performance, symbolizing enthrallment.",
        "example_sentence": "The magician’s tricks enthralled the audience, leaving them in awe."
    },
    {
        "word": "Fodder",
        "part_of_speech": "Noun",
        "definition": "Food, especially dried hay or feed, for cattle and other livestock; material that is used for a particular purpose.",
        "hindi_meaning": "चारा, खुराक",
        "mnemonic": "Fodder sounds like 'food-er,' indicating something that serves as basic material or food.",
        "visual_representation": "Picture a pile of hay being used to feed farm animals, symbolizing fodder.",
        "example_sentence": "The scandal provided plenty of fodder for the tabloids."
    },
    {
        "word": "Grotesque",
        "part_of_speech": "Adjective / Noun",
        "definition": "Comically or repulsively ugly or distorted; a very ugly or comically distorted figure or image.",
        "hindi_meaning": "विचित्र, विकृत",
        "mnemonic": "Grotesque sounds like 'gross-tech,' indicating something distorted or ugly in a disturbing way.",
        "visual_representation": "Imagine a statue with exaggerated and distorted features, symbolizing something grotesque.",
        "example_sentence": "The grotesque mask frightened the children at the Halloween party."
    },
    {
        "word": "Humane",
        "part_of_speech": "Adjective",
        "definition": "Having or showing compassion or benevolence.",
        "hindi_meaning": "मानवीय, दयालु",
        "mnemonic": "Humane sounds like 'human,' indicating compassion and kindness.",
        "visual_representation": "Picture someone rescuing an injured animal and caring for it, symbolizing humane behavior.",
        "example_sentence": "The organization is known for its humane treatment of animals."
    },
    {
        "word": "Incentive",
        "part_of_speech": "Noun",
        "definition": "A thing that motivates or encourages someone to do something.",
        "hindi_meaning": "प्रेरणा, प्रोत्साहन",
        "mnemonic": "Incentive sounds like 'in-centive,' indicating something that adds motivation.",
        "visual_representation": "Imagine a bonus check being handed to an employee as a reward for hard work, symbolizing incentive.",
        "example_sentence": "The company offered financial incentives to employees who met their targets."
    },
    {
        "word": "Luscious",
        "part_of_speech": "Adjective",
        "definition": "(Of food or drink) having a pleasingly rich, sweet taste; richly verdant or luxurious.",
        "hindi_meaning": "स्वादिष्ट, रसीला",
        "mnemonic": "Luscious sounds like 'lush-ious,' indicating something richly pleasing, especially in taste.",
        "visual_representation": "Picture a plate of rich, decadent chocolate cake, symbolizing lusciousness.",
        "example_sentence": "The luscious fruit was perfectly ripe and bursting with flavor."
    },
    {
        "word": "Militant",
        "part_of_speech": "Adjective / Noun",
        "definition": "Combative and aggressive in support of a cause; a person who is combative in the support of a cause.",
        "hindi_meaning": "लड़ाकू, उग्र",
        "mnemonic": "Militant sounds like 'military-ant,' indicating someone or something aggressively fighting for a cause.",
        "visual_representation": "Picture a group of activists marching with signs, passionately advocating for their cause, symbolizing militancy.",
        "example_sentence": "The militant group demanded immediate action on climate change."
    },
    {
        "word": "Nocturnal",
        "part_of_speech": "Adjective",
        "definition": "Active at night.",
        "hindi_meaning": "निशाचर, रात का",
        "mnemonic": "Nocturnal sounds like 'knock-turnal,' indicating activity during the night.",
        "visual_representation": "Imagine an owl hunting at night, symbolizing nocturnal behavior.",
        "example_sentence": "Owls are nocturnal creatures, hunting for prey in the dark."
    },
    {
        "word": "Obscure",
        "part_of_speech": "Adjective / Verb",
        "definition": "Not discovered or known about; uncertain; to keep from being seen or to conceal.",
        "hindi_meaning": "अस्पष्ट, धुंधला करना",
        "mnemonic": "Obscure sounds like 'obstacle-cure,' indicating something hidden or not clear.",
        "visual_representation": "Picture a foggy landscape where details are hard to see, symbolizing obscurity.",
        "example_sentence": "The meaning of the poem was obscure, leaving many readers puzzled."
    },
    {
        "word": "Peripheral",
        "part_of_speech": "Adjective / Noun",
        "definition": "Relating to or situated on the edge or periphery of something; of secondary or minor importance.",
        "hindi_meaning": "परिधीय, गौण",
        "mnemonic": "Peripheral sounds like 'peri-fair-al,' indicating something on the outer edges or less important.",
        "visual_representation": "Picture a person focusing on a central object while other things are blurred on the edges, symbolizing peripheral vision.",
        "example_sentence": "The issue is peripheral to the main problem and doesn’t need to be addressed immediately."
    },
    {
        "word": "Remission",
        "part_of_speech": "Noun",
        "definition": "A temporary or permanent decrease or subsidence of the symptoms of a disease; the cancellation of a debt, charge, or penalty.",
        "hindi_meaning": "माफी, रोग की कमी",
        "mnemonic": "Remission sounds like 're-mission,' indicating a reduction or pause in symptoms or penalties.",
        "visual_representation": "Imagine a patient experiencing relief from illness symptoms, symbolizing remission.",
        "example_sentence": "The patient’s cancer is in remission, and the doctors are hopeful for a full recovery."
    },
    {
        "word": "Sheaf",
        "part_of_speech": "Noun",
        "definition": "A bundle of grain stalks laid lengthwise and tied together after reaping; any bundle of things tied together.",
        "hindi_meaning": "गट्ठर, पुलिंदा",
        "mnemonic": "Sheaf sounds like 'shelf,' where things are bundled or stacked together.",
        "visual_representation": "Picture a bundle of wheat tied together after harvest, symbolizing a sheaf.",
        "example_sentence": "The farmer carried a sheaf of wheat back to the barn."
    },
    {
        "word": "Transient",
        "part_of_speech": "Adjective / Noun",
        "definition": "Lasting only for a short time; temporary; a person who is staying or working in a place for only a short time.",
        "hindi_meaning": "क्षणिक, अस्थायी",
        "mnemonic": "Transient sounds like 'transit,' indicating something that is passing or temporary.",
        "visual_representation": "Imagine a cloud quickly passing across the sky, symbolizing something transient.",
        "example_sentence": "The transient nature of youth makes it all the more precious."
    },
    {
        "word": "Unearth",
        "part_of_speech": "Verb",
        "definition": "To find something in the ground by digging; to discover something hidden, lost, or kept secret.",
        "hindi_meaning": "खोद निकालना, उजागर करना",
        "mnemonic": "Unearth sounds like 'un-earth,' indicating something hidden being dug up or discovered.",
        "visual_representation": "Picture an archaeologist digging up ancient artifacts from the ground, symbolizing unearthing.",
        "example_sentence": "The investigation unearthed new evidence that could change the outcome of the case."
    },
    {
        "word": "Veer",
        "part_of_speech": "Verb",
        "definition": "To change direction suddenly.",
        "hindi_meaning": "दिशा बदलना, मुड़ना",
        "mnemonic": "Veer sounds like 'veer off,' indicating a sudden change in direction.",
        "visual_representation": "Picture a car suddenly swerving to avoid an obstacle, symbolizing veering.",
        "example_sentence": "The driver had to veer off the road to avoid hitting a deer."
    },
    {
        "word": "Weather",
        "part_of_speech": "Verb",
        "definition": "To withstand or survive a difficult situation; to endure.",
        "hindi_meaning": "सहना, झेलना",
        "mnemonic": "Weather sounds like 'weather the storm,' indicating surviving or enduring something challenging.",
        "visual_representation": "Picture a ship sailing through a stormy sea, symbolizing weathering a difficult situation.",
        "example_sentence": "The company managed to weather the economic downturn and emerged stronger."
    }
]
