[
    {
        "word": "Acrophobia",
        "part_of_speech": "Noun",
        "definition": "An extreme or irrational fear of heights.",
        "hindi_meaning": "ऊँचाई से डर, ऊँचाई का भय",
        "mnemonic": "Acrophobia combines 'acro' (heights) and 'phobia' (fear), indicating fear of heights.",
        "visual_representation": "Picture someone standing at the edge of a tall building, trembling in fear, symbolizing acrophobia.",
        "example_sentence": "Her acrophobia made it impossible for her to enjoy the view from the top of the mountain."
    },
    {
        "word": "Bestow",
        "part_of_speech": "Verb",
        "definition": "To give something as an honor or present.",
        "hindi_meaning": "प्रदान करना, देना",
        "mnemonic": "Bestow sounds like 'be stow,' as in to stow or give something valuable to someone.",
        "visual_representation": "Imagine a king placing a crown on someone’s head, symbolizing bestowing an honor.",
        "example_sentence": "The university bestowed an honorary degree on the famous author."
    },
    {
        "word": "Cavil",
        "part_of_speech": "Verb / Noun",
        "definition": "To make petty or unnecessary objections; a trivial objection or criticism.",
        "hindi_meaning": "बेवजह की आलोचना करना, तुच्छ आपत्ति",
        "mnemonic": "Cavil sounds like 'cave all,' where someone nitpicks at every little thing, like digging up minor faults.",
        "visual_representation": "Picture someone pointing out tiny flaws in a well-made painting, symbolizing caviling.",
        "example_sentence": "The critic caviled at the minor details of the film, ignoring its overall brilliance."
    },
    {
        "word": "Delude",
        "part_of_sech": "Verb",
        "definition": "To impose a misleading belief upon someone; to deceive or fool.",
        "hindi_meaning": "भ्रमित करना, धोखा देना",
        "mnemonic": "Delude sounds like 'delude,' like dilute the truth, meaning to deceive someone.",
        "visual_representation": "Imagine someone selling fake gold, deluding buyers into thinking it’s real.",
        "example_sentence": "He was deluded into thinking he could get away with the crime."
    },
    {
        "word": "Endearment",
        "part_of_speech": "Noun",
        "definition": "A word or phrase expressing love or affection.",
        "hindi_meaning": "स्नेह या प्यार का शब्द, प्रेमसूचक शब्द",
        "mnemonic": "Endearment sounds like 'in dear,' as in something dear to your heart, showing affection.",
        "visual_representation": "Picture someone whispering 'sweetheart' or 'darling' to a loved one, symbolizing endearment.",
        "example_sentence": "She used terms of endearment when talking to her children, like 'my love' and 'dear.'"
    },
    {
        "word": "Flair",
        "part_of_speech": "Noun",
        "definition": "A special or instinctive aptitude or ability for doing something well; stylishness and originality.",
        "hindi_meaning": "खास प्रतिभा, स्टाइल",
        "mnemonic": "Flair sounds like 'flare,' as in a burst of talent or style.",
        "visual_representation": "Imagine someone with a natural talent for playing the piano, playing with style and ease, symbolizing flair.",
        "example_sentence": "He has a flair for writing compelling stories that captivate readers."
    },
    {
        "word": "Gouge",
        "part_of_speech": "Verb / Noun",
        "definition": "To make a groove, hole, or indentation with a sharp tool or blade; to overcharge or swindle; a groove or hole made by gouging.",
        "hindi_meaning": "खरोंचना, गड्ढा करना; धोखाधड़ी करना",
        "mnemonic": "Gouge sounds like 'gouge out,' as in to dig out or hollow something with a sharp tool.",
        "visual_representation": "Picture someone using a chisel to carve out a piece of wood, symbolizing gouging.",
        "example_sentence": "The carpenter accidentally gouged a deep groove in the table while working on it."
    },
    {
        "word": "Hypercritical",
        "part_of_speech": "Adjective",
        "definition": "Excessively and unreasonably critical, especially of small faults.",
        "hindi_meaning": "अत्यधिक आलोचनात्मक, छोटी-छोटी बातों में नुक्स निकालने वाला",
        "mnemonic": "Hypercritical combines 'hyper' (excessive) and 'critical,' indicating overly critical behavior.",
        "visual_representation": "Imagine someone constantly criticizing every little thing, symbolizing hypercritical behavior.",
        "example_sentence": "Her hypercritical comments made it hard for anyone to enjoy the performance."
    },
    {
        "word": "Impregnable",
        "part_of_speech": "Adjective",
        "definition": "Unable to be captured or broken into; invincible.",
        "hindi_meaning": "अभेद्य, अजेय",
        "mnemonic": "Impregnable sounds like 'impenetrable,' meaning something that cannot be breached or overcome.",
        "visual_representation": "Picture a fortress with high, thick walls that no enemy can breach, symbolizing impregnable.",
        "example_sentence": "The castle was considered impregnable, with walls so thick they could withstand any attack."
    },
    {
        "word": "Log",
        "part_of_speech": "Noun / Verb",
        "definition": "A part of the trunk or a large branch of a tree that has fallen or been cut off; to enter an event or fact in a record.",
        "hindi_meaning": "लकड़ी का टुकड़ा, लॉग बुक में दर्ज करना",
        "mnemonic": "Log sounds like 'logbook,' where records are kept, or a literal log from a tree.",
        "visual_representation": "Imagine a large, heavy log of wood or someone writing details in a logbook, symbolizing recording.",
        "example_sentence": "The ship’s captain logged the coordinates and events of the day in the ship’s logbook."
    },
    {
        "word": "Menagerie",
        "part_of_speech": "Noun",
        "definition": "A collection of wild animals kept in captivity for exhibition; a diverse or unusual group of people or things.",
        "hindi_meaning": "वन्य जीवों का संग्रहालय, विविध समूह",
        "mnemonic": "Menagerie sounds like 'manage-ery,' like managing a collection of various animals or things.",
        "visual_representation": "Picture a zoo with various exotic animals in enclosures, symbolizing a menagerie.",
        "example_sentence": "The circus’s menagerie included lions, tigers, and a host of other exotic animals."
    },
    {
        "word": "Nautical",
        "part_of_speech": "Adjective",
        "definition": "Relating to sailors, ships, or navigation.",
        "hindi_meaning": "नौचालन संबंधी, जहाज़ का",
        "mnemonic": "Nautical sounds like 'nautical mile,' a term used in sailing or navigation.",
        "visual_representation": "Imagine a sailor navigating a ship on the ocean, symbolizing something nautical.",
        "example_sentence": "The museum has a large collection of nautical instruments and maps from the 18th century."
    },
    {
        "word": "Ornithology",
        "part_of_speech": "Noun",
        "definition": "The scientific study of birds.",
        "hindi_meaning": "पक्षीविज्ञान",
        "mnemonic": "Ornithology sounds like 'ornitho-logy,' where 'ornitho' refers to birds and 'logy' means study.",
        "visual_representation": "Picture a scientist observing birds in the wild with binoculars, symbolizing ornithology.",
        "example_sentence": "His passion for bird-watching led him to study ornithology in college."
    },
    {
        "word": "Pedant",
        "part_of_speech": "Noun",
        "definition": "A person who is excessively concerned with minor details and rules or with displaying academic learning.",
        "hindi_meaning": "विद्वान होने का ढोंग करने वाला, शब्दाडंबरवादी",
        "mnemonic": "Pedant sounds like 'pendant,' as if someone hangs on every tiny detail like a pendant.",
        "visual_representation": "Picture a teacher constantly correcting students over trivial matters, symbolizing a pedant.",
        "example_sentence": "He is such a pedant that he insists on correcting everyone’s grammar, even in casual conversation."
    },
    {
        "word": "Refrain",
        "part_of_speech": "Verb / Noun",
        "definition": "To stop oneself from doing something; a repeated line or number of lines in a song or poem, typically at the end of each verse.",
        "hindi_meaning": "परहेज करना, गीत की पुनरावृत्ति",
        "mnemonic": "Refrain sounds like 'refrain from,' meaning to hold back or repeat a part of a song.",
        "visual_representation": "Picture someone holding back from eating a dessert or the chorus of a song repeating, symbolizing a refrain.",
        "example_sentence": "Please refrain from talking during the performance."
    },
    {
        "word": "Sedulous",
        "part_of_speech": "Adjective",
        "definition": "Showing dedication and diligence.",
        "hindi_meaning": "परिश्रमी, मेहनती",
        "mnemonic": "Sedulous sounds like 'schedule us,' as in someone who is diligent and sticks to their schedule.",
        "visual_representation": "Imagine a student studying late into the night, showing dedication to their work, symbolizing sedulous.",
        "example_sentence": "Her sedulous efforts in preparing for the exam paid off when she scored the highest marks."
    },
    {
        "word": "Toady",
        "part_of_speech": "Noun / Verb",
        "definition": "A person who behaves obsequiously to someone important; to act in an obsequious way.",
        "hindi_meaning": "चमचा, चापलूस",
        "mnemonic": "Toady sounds like 'toad,' as if someone is bowing down low like a toad to flatter someone.",
        "visual_representation": "Picture someone constantly flattering their boss, agreeing with everything they say, symbolizing a toady.",
        "example_sentence": "The toady always agreed with the boss, hoping to get a promotion."
    },
    {
        "word": "Unwieldy",
        "part_of_speech": "Adjective",
        "definition": "Difficult to carry or move because of its size, shape, or weight; awkward or clumsy.",
        "hindi_meaning": "भारी, कठिन",
        "mnemonic": "Unwieldy sounds like 'un-wield,' meaning difficult to handle or manage.",
        "visual_representation": "Imagine someone struggling to carry a large, awkwardly shaped box, symbolizing something unwieldy.",
        "example_sentence": "The package was so unwieldy that she had to ask for help to carry it."
    },
    {
        "word": "Vise",
        "part_of_speech": "Noun",
        "definition": "A tool with movable jaws that are used to hold an object firmly in place, typically while work is being done on it.",
        "hindi_meaning": "शिकंजा, पकड़ने का उपकरण",
        "mnemonic": "Vise sounds like 'vice grip,' indicating a tool that holds things tightly.",
        "visual_representation": "Picture a metal tool gripping a piece of wood tightly so it doesn’t move, symbolizing a vise.",
        "example_sentence": "He placed the wood in the vise before sawing it to ensure it wouldn’t move."
    },
    {
        "word": "Wrath",
        "part_of_speech": "Noun",
        "definition": "Extreme anger.",
        "hindi_meaning": "क्रोध, गुस्सा",
        "mnemonic": "Wrath sounds like 'wraith,' as in a ghostly anger, indicating intense fury.",
        "visual_representation": "Imagine someone’s face turning red with rage, symbolizing wrath.",
        "example_sentence": "The wrath of the king was feared by all who served in his court."
    }
]
