[
    {
        "word": "Affected",
        "part_of_speech": "Adjective",
        "definition": "Artificial, pretentious, and designed to impress.",
        "hindi_meaning": "बनावटी, आडंबरपूर्ण",
        "mnemonic": "Affected sounds like 'affect-ed,' as if someone is trying to put on an effect or pretense to impress others.",
        "visual_representation": "Imagine someone speaking in an exaggerated, unnatural way to appear sophisticated, symbolizing affected behavior.",
        "example_sentence": "His affected manner of speaking made him seem insincere."
    },
    {
        "word": "Bohemian",
        "part_of_speech": "Adjective / Noun",
        "definition": "Socially unconventional, especially in a way that is perceived as artistic; a person who lives an unconventional lifestyle, often in a community with like-minded individuals.",
        "hindi_meaning": "स्वतंत्र विचारों वाला, मस्तमौला",
        "mnemonic": "Bohemian sounds like 'free-him,' indicating someone who is free-spirited and nonconformist.",
        "visual_representation": "Picture an artist living in a colorful, eclectic space filled with creative works, symbolizing a bohemian lifestyle.",
        "example_sentence": "The café was a popular spot for bohemian artists and writers."
    },
    {
        "word": "Chauvinist",
        "part_of_speech": "Noun",
        "definition": "A person displaying aggressive or exaggerated patriotism; someone who believes in the superiority of their own group, often without merit.",
        "hindi_meaning": "अंध राष्ट्रवादी, संकीर्ण विचारक",
        "mnemonic": "Chauvinist sounds like 'show-win-ist,' as if someone is excessively showing off their loyalty to a group or nation.",
        "visual_representation": "Imagine a person loudly proclaiming their country’s superiority over others, symbolizing chauvinism.",
        "example_sentence": "His chauvinist attitude made it difficult for him to appreciate other cultures."
    },
    {
        "word": "Derogatory",
        "part_of_speech": "Adjective",
        "definition": "Showing a critical or disrespectful attitude.",
        "hindi_meaning": "अपमानजनक, अवमाननापूर्ण",
        "mnemonic": "Derogatory sounds like 'derogate-story,' as if someone is telling a story that puts others down.",
        "visual_representation": "Picture someone making a sneering comment that hurts another person’s feelings, symbolizing a derogatory remark.",
        "example_sentence": "She was hurt by his derogatory comments about her work."
    },
    {
        "word": "Ephemeral",
        "part_of_speech": "Adjective",
        "definition": "Lasting for a very short time.",
        "hindi_meaning": "क्षणिक, अल्पकालिक",
        "mnemonic": "Ephemeral sounds like 'effem-er-al,' indicating something that fades away quickly, like a fleeting moment.",
        "visual_representation": "Imagine a flower that blooms for just one day before wilting, symbolizing something ephemeral.",
        "example_sentence": "The beauty of the sunset was ephemeral, disappearing within minutes."
    },
    {
        "word": "Forensic",
        "part_of_speech": "Adjective",
        "definition": "Relating to or denoting the application of scientific methods and techniques to the investigation of crime.",
        "hindi_meaning": "न्यायिक, अपराधविज्ञान संबंधी",
        "mnemonic": "Forensic sounds like 'for-science,' indicating the use of science to solve crimes.",
        "visual_representation": "Picture a forensic scientist analyzing evidence in a lab to solve a criminal case.",
        "example_sentence": "The forensic team found crucial evidence at the crime scene."
    },
    {
        "word": "Gullible",
        "part_of_speech": "Adjective",
        "definition": "Easily persuaded to believe something; credulous.",
        "hindi_meaning": "भोला, आसानी से विश्वास करने वाला",
        "mnemonic": "Gullible sounds like 'gull-able,' as if someone is able to be tricked easily like a gull (a type of bird known for being easily fooled).",
        "visual_representation": "Imagine someone believing a far-fetched story without question, symbolizing gullibility.",
        "example_sentence": "He was so gullible that he believed the prank call was real."
    },
    {
        "word": "Hone",
        "part_of_speech": "Verb",
        "definition": "To sharpen a blade; to refine or perfect something over a period of time.",
        "hindi_meaning": "धार तेज करना, सुधारना",
        "mnemonic": "Hone sounds like 'home in,' as if you are focusing and perfecting something to make it precise.",
        "visual_representation": "Picture a chef sharpening a knife until it’s razor-sharp, symbolizing honing a skill.",
        "example_sentence": "She spent years honing her skills as a pianist."
    },
    {
        "word": "Inclusive",
        "part_of_speech": "Adjective",
        "definition": "Including all the services or items normally expected or required; not excluding any particular groups or individuals.",
        "hindi_meaning": "समावेशी, सभी को शामिल करने वाला",
        "mnemonic": "Inclusive sounds like 'in-clue-sive,' as if everything and everyone is included.",
        "visual_representation": "Picture a group of diverse people all holding hands in a circle, symbolizing inclusivity.",
        "example_sentence": "The company’s inclusive policies ensure that everyone feels welcome."
    },
    {
        "word": "Leery",
        "part_of_speech": "Adjective",
        "definition": "Cautious or wary due to realistic suspicions.",
        "hindi_meaning": "संदिग्ध, शंकालु",
        "mnemonic": "Leery sounds like 'weary,' indicating being cautious or on guard.",
        "visual_representation": "Picture someone looking over their shoulder, suspicious of what’s behind them, symbolizing being leery.",
        "example_sentence": "She was leery of the stranger’s offer to help."
    },
    {
        "word": "Mischance",
        "part_of_speech": "Noun",
        "definition": "Bad luck; an unfortunate occurrence.",
        "hindi_meaning": "दुर्भाग्य, आपदा",
        "mnemonic": "Mischance sounds like 'miss-chance,' indicating a missed opportunity or bad luck.",
        "visual_representation": "Picture someone slipping on a banana peel, symbolizing an unfortunate accident or mischance.",
        "example_sentence": "By mischance, the letter was delivered to the wrong address."
    },
    {
        "word": "Optimum",
        "part_of_speech": "Adjective / Noun",
        "definition": "Most conducive to a favorable outcome; best.",
        "hindi_meaning": "सर्वोत्तम, सबसे अनुकूल",
        "mnemonic": "Optimum sounds like 'opt-i-mum,' indicating the best or most favorable condition.",
        "visual_representation": "Imagine a plant growing in perfect conditions with ample sunlight and water, symbolizing the optimum environment.",
        "example_sentence": "The athlete trained under optimum conditions to prepare for the competition."
    },
    {
        "word": "Perspicacious",
        "part_of_speech": "Adjective",
        "definition": "Having a ready insight into and understanding of things.",
        "hindi_meaning": "सूक्ष्मदर्शी, तीक्ष्ण बुद्धि वाला",
        "mnemonic": "Perspicacious sounds like 'perspective-cautious,' indicating someone who has sharp insight and understanding.",
        "visual_representation": "Picture a detective noticing small clues that others miss, symbolizing perspicacity.",
        "example_sentence": "The perspicacious judge quickly realized the truth behind the defendant’s testimony."
    },
    {
        "word": "Renown",
        "part_of_speech": "Noun",
        "definition": "The condition of being known or talked about by many people; fame.",
        "hindi_meaning": "प्रसिद्धि, यश",
        "mnemonic": "Renown sounds like 're-known,' as if someone is well-known or famous.",
        "visual_representation": "Imagine a famous celebrity surrounded by photographers and fans, symbolizing renown.",
        "example_sentence": "The artist’s renown grew after her work was featured in a major gallery."
    },
    {
        "word": "Simian",
        "part_of_speech": "Adjective / Noun",
        "definition": "Relating to, resembling, or affecting apes or monkeys; an ape or monkey.",
        "hindi_meaning": "कपि-संबंधी, बंदर जैसा",
        "mnemonic": "Simian sounds like 'sim-ian,' indicating something similar to an ape or monkey.",
        "visual_representation": "Picture a monkey swinging from a tree, symbolizing something simian.",
        "example_sentence": "His simian features reminded her of a chimpanzee."
    },
    {
        "word": "Treacly",
        "part_of_speech": "Adjective",
        "definition": "Resembling treacle in consistency; overly sweet or sentimental.",
        "hindi_meaning": "बहुत मीठा, अतिसंवेदनशील",
        "mnemonic": "Treacly sounds like 'trickly,' as if something is thick and overly sweet like syrup.",
        "visual_representation": "Imagine a scene in a movie where everything is overly sentimental and saccharine, symbolizing something treacly.",
        "example_sentence": "The movie’s treacly ending was too sugary-sweet for most viewers."
    },
    {
        "word": "Unsightly",
        "part_of_speech": "Adjective",
        "definition": "Unpleasant to look at; ugly.",
        "hindi_meaning": "बदसूरत, अनाकर्षक",
        "mnemonic": "Unsightly sounds like 'un-sight-ly,' indicating something that is not pleasant to see.",
        "visual_representation": "Picture a dilapidated building with peeling paint and broken windows, symbolizing something unsightly.",
        "example_sentence": "The unsightly trash piled up in the alley was a nuisance for the neighborhood."
    },
    {
        "word": "Vignette",
        "part_of_speech": "Noun",
        "definition": "A brief evocative description, account, or episode; a small illustration or portrait photograph that fades into its background without a definite border.",
        "hindi_meaning": "लघु कथा, छोटी कहानी; धुंधली रूपरेखा",
        "mnemonic": "Vignette sounds like 'vin-yet,' indicating a small, delicate, or blurred illustration or story.",
        "visual_representation": "Picture a small, delicate drawing or a short scene from a film that leaves a strong impression, symbolizing a vignette.",
        "example_sentence": "The author included a poignant vignette about her childhood in her memoir."
    }
]
