[
    {
        "word": "Adapt",
        "part_of_speech": "Verb",
        "definition": "To make something suitable for a new use or purpose; to modify; to become adjusted to new conditions.",
        "hindi_meaning": "अनुकूल बनाना, ढालना",
        "mnemonic": "Adapt sounds like 'add apt,' meaning to make something apt or suitable for a new situation.",
        "visual_representation": "Picture a chameleon changing its color to blend into its surroundings, symbolizing adaptation.",
        "example_sentence": "Animals must adapt to their environment in order to survive."
    },
    {
        "word": "Biennial",
        "part_of_speech": "Adjective / Noun",
        "definition": "Taking place every two years; a plant that takes two years to grow from seed to fruition and die.",
        "hindi_meaning": "द्विवाषिक, दो साल में एक बार",
        "mnemonic": "Biennial sounds like 'bi-annual,' indicating something that happens every two years.",
        "visual_representation": "Picture an event that takes place every two years, such as the Olympics, symbolizing something biennial.",
        "example_sentence": "The biennial art exhibition attracts artists from all over the world."
    },
    {
        "word": "Censure",
        "part_of_speech": "Verb / Noun",
        "definition": "To express severe disapproval of someone or something, especially in a formal statement; the expression of formal disapproval.",
        "hindi_meaning": "निंदा करना, आलोचना करना",
        "mnemonic": "Censure sounds like 'censor,' as in to criticize or officially disapprove of something.",
        "visual_representation": "Imagine a judge scolding someone for improper behavior, symbolizing censure.",
        "example_sentence": "The employee was censured for repeatedly violating company policies."
    },
    {
        "word": "Demise",
        "part_of_speech": "Noun",
        "definition": "A person's death; the end or failure of an enterprise or institution.",
        "hindi_meaning": "मृत्यु, अंत",
        "mnemonic": "Demise sounds like 'de-miss,' as in someone you will miss because of their death.",
        "visual_representation": "Picture a newspaper headline announcing the death of a famous person, symbolizing demise.",
        "example_sentence": "The sudden demise of the CEO left the company in shock."
    },
    {
        "word": "Engaging",
        "part_of_speech": "Adjective",
        "definition": "Charming and attractive; holding the attention or interest of someone.",
        "hindi_meaning": "आकर्षक, मनमोहक",
        "mnemonic": "Engaging sounds like 'engage in,' meaning something that captures your attention or interest.",
        "visual_representation": "Picture a lively conversation that everyone is interested in, symbolizing something engaging.",
        "example_sentence": "The speaker was very engaging, and the audience was captivated by her presentation."
    },
    {
        "word": "Flinch",
        "part_of_speech": "Verb / Noun",
        "definition": "To make a quick, nervous movement as an instinctive reaction to fear, pain, or surprise; an act of flinching.",
        "hindi_meaning": "झिझकना, डर से पीछे हटना",
        "mnemonic": "Flinch sounds like 'fling back,' indicating a sudden, reflexive movement.",
        "visual_representation": "Picture someone pulling back quickly when a ball is unexpectedly thrown at them, symbolizing flinching.",
        "example_sentence": "He didn’t even flinch when the loud noise startled everyone else."
    },
    {
        "word": "Granulate",
        "part_of_speech": "Verb",
        "definition": "To form into grains or particles; to become grainy.",
        "hindi_meaning": "कण में बदलना, दानेदार बनाना",
        "mnemonic": "Granulate sounds like 'grain-late,' indicating something that turns into grains.",
        "visual_representation": "Picture sugar crystals forming from a liquid into granules, symbolizing granulation.",
        "example_sentence": "The salt began to granulate as the water evaporated."
    },
    {
        "word": "Harrowing",
        "part_of_speech": "Adjective",
        "definition": "Extremely distressing; disturbing or frightening.",
        "hindi_meaning": "दर्दनाक, कष्टदायक",
        "mnemonic": "Harrowing sounds like 'narrowing,' as in a narrow escape from a dangerous situation, causing distress.",
        "visual_representation": "Picture someone having a terrifying experience, like being trapped in a storm, symbolizing something harrowing.",
        "example_sentence": "The survivors told a harrowing tale of their time lost at sea."
    },
    {
        "word": "Impunity",
        "part_of_speech": "Noun",
        "definition": "Exemption from punishment or freedom from the injurious consequences of an action.",
        "hindi_meaning": "दंड से मुक्ति, सज़ा से छूट",
        "mnemonic": "Impunity sounds like 'I’m puny,' as if someone feels so small they think they won’t be caught or punished.",
        "visual_representation": "Picture someone committing a crime and walking away without facing any consequences, symbolizing impunity.",
        "example_sentence": "The dictator ruled with impunity, never facing consequences for his actions."
    },
    {
        "word": "Lucid",
        "part_of_speech": "Adjective",
        "definition": "Expressed clearly; easy to understand; bright or luminous.",
        "hindi_meaning": "स्पष्ट, चमकीला",
        "mnemonic": "Lucid sounds like 'loose lid,' where the lid is off and everything is clear and understandable.",
        "visual_representation": "Imagine a clear, bright light illuminating a room, symbolizing clarity or lucidity.",
        "example_sentence": "The professor’s explanation was so lucid that even the most complex concepts became easy to grasp."
    },
    {
        "word": "Mesmerize",
        "part_of_speech": "Verb",
        "definition": "To hold the attention of someone to the exclusion of all else; to hypnotize.",
        "hindi_meaning": "मोहित करना, सम्मोहित करना",
        "mnemonic": "Mesmerize sounds like 'mesmer eyes,' as if someone’s eyes are so captivating they hypnotize you.",
        "visual_representation": "Picture someone staring intently at a spinning object, completely entranced, symbolizing mesmerization.",
        "example_sentence": "The magician’s performance was so captivating that it mesmerized the entire audience."
    },
    {
        "word": "Negligence",
        "part_of_speech": "Noun",
        "definition": "Failure to take proper care in doing something; carelessness.",
        "hindi_meaning": "लापरवाही, उपेक्षा",
        "mnemonic": "Negligence sounds like 'neglect-gence,' indicating the act of neglecting or failing to care for something.",
        "visual_representation": "Picture a person failing to lock their car door, resulting in a theft, symbolizing negligence.",
        "example_sentence": "The accident was a result of the driver’s negligence."
    },
    {
        "word": "Outlandish",
        "part_of_speech": "Adjective",
        "definition": "Looking or sounding bizarre or unfamiliar; strange.",
        "hindi_meaning": "अजीब, विचित्र",
        "mnemonic": "Outlandish sounds like 'out-landish,' as if something is from a strange or foreign land.",
        "visual_representation": "Imagine someone wearing an extremely bizarre outfit that stands out in a crowd, symbolizing something outlandish.",
        "example_sentence": "Her outlandish ideas often left people bewildered."
    },
    {
        "word": "Pendant",
        "part_of_speech": "Noun",
        "definition": "A piece of jewelry that hangs from a chain worn around the neck.",
        "hindi_meaning": "लटकन, गले का हार",
        "mnemonic": "Pendant sounds like 'pendant light,' which hangs from the ceiling, similar to how a pendant hangs from a necklace.",
        "visual_representation": "Picture a beautiful gemstone hanging from a necklace chain, symbolizing a pendant.",
        "example_sentence": "She wore a silver pendant shaped like a heart."
    },
    {
        "word": "Reimburse",
        "part_of_speech": "Verb",
        "definition": "To repay a person who has spent or lost money; to compensate.",
        "hindi_meaning": "वापस करना, प्रतिपूर्ति करना",
        "mnemonic": "Reimburse sounds like 're-im-burse,' as if someone is putting money back into your purse.",
        "visual_representation": "Imagine someone handing back money that was borrowed, symbolizing reimbursement.",
        "example_sentence": "The company will reimburse you for any travel expenses."
    },
    {
        "word": "Sententious",
        "part_of_speech": "Adjective",
        "definition": "Given to moralizing in a pompous or affected manner.",
        "hindi_meaning": "नीतिपरक, उपदेशात्मक",
        "mnemonic": "Sententious sounds like 'sentence us,' as if someone is judging or moralizing others.",
        "visual_representation": "Picture someone giving a long, pompous speech full of moral lessons, symbolizing sententious behavior.",
        "example_sentence": "His sententious remarks during the meeting annoyed everyone."
    },
    {
        "word": "Tortuous",
        "part_of_speech": "Adjective",
        "definition": "Full of twists and turns; excessively lengthy and complex.",
        "hindi_meaning": "पेचीदा, घुमावदार",
        "mnemonic": "Tortuous sounds like 'torture us,' indicating something that is difficult to follow or understand due to its complexity.",
        "visual_representation": "Imagine a winding, twisting road that is difficult to navigate, symbolizing something tortuous.",
        "example_sentence": "The tortuous path through the mountains made the journey long and difficult."
    },
    {
        "word": "Unprepossessing",
        "part_of_speech": "Adjective",
        "definition": "Not attractive or appealing to the eye.",
        "hindi_meaning": "साधारण, आकर्षक नहीं",
        "mnemonic": "Unprepossessing sounds like 'un-pre-possessing,' indicating something that does not possess appeal or attractiveness.",
        "visual_representation": "Picture a plain, unremarkable building that doesn’t catch your eye, symbolizing something unprepossessing.",
        "example_sentence": "Despite its unprepossessing exterior, the restaurant serves some of the best food in town."
    },
    {
        "word": "Volatile",
        "part_of_speech": "Adjective",
        "definition": "Liable to change rapidly and unpredictably, especially for the worse; easily evaporated at normal temperatures.",
        "hindi_meaning": "अस्थिर, विस्फोटक",
        "mnemonic": "Volatile sounds like 'volatile substance,' something that can easily explode or change.",
        "visual_representation": "Picture a chemical that reacts explosively when exposed to heat, symbolizing volatility.",
        "example_sentence": "The stock market is highly volatile, with prices changing rapidly."
    },
    {
        "word": "Witticism",
        "part_of_speech": "Noun",
        "definition": "A clever or witty remark or comment.",
        "hindi_meaning": "मजाक, हाजिर जवाबी",
        "mnemonic": "Witticism sounds like 'wit-cism,' indicating a sharp or clever comment.",
        "visual_representation": "Picture someone making a quick, humorous comment that makes everyone laugh, symbolizing a witticism.",
        "example_sentence": "His witticism during the meeting lightened the mood and made everyone laugh."
    }
]
