[
    {
        "word": "Addiction",
        "part_of_speech": "Noun",
        "definition": "The fact or condition of being addicted to a particular substance, thing, or activity.",
        "hindi_meaning": "लत, व्यसन",
        "mnemonic": "Addiction sounds like 'addition,' indicating an added or uncontrollable craving.",
        "visual_representation": "Picture someone repeatedly reaching for a substance, unable to resist, symbolizing addiction.",
        "example_sentence": "His addiction to video games began to affect his schoolwork and social life."
    },
    {
        "word": "Bilious",
        "part_of_speech": "Adjective",
        "definition": "Affected by or associated with nausea or vomiting; spiteful or bad-tempered.",
        "hindi_meaning": "पित्त संबंधी, चिड़चिड़ा",
        "mnemonic": "Bilious sounds like 'bile,' the bitter fluid associated with illness and bad temper.",
        "visual_representation": "Picture someone with a greenish tint, looking nauseous and irritable, symbolizing being bilious.",
        "example_sentence": "The bilious man grumbled at everything, making those around him uncomfortable."
    },
    {
        "word": "Centrifugal",
        "part_of_speech": "Adjective",
        "definition": "Moving or tending to move away from a center.",
        "hindi_meaning": "केन्द्रीयविकर्षक, केंद्र से दूर जाने वाला",
        "mnemonic": "Centrifugal sounds like 'center-flee,' indicating movement away from the center.",
        "visual_representation": "Picture a spinning wheel where objects are thrown outward, away from the center, symbolizing centrifugal force.",
        "example_sentence": "The centrifugal force caused the water to fly out of the spinning bucket."
    },
    {
        "word": "Demoniac",
        "part_of_speech": "Adjective / Noun",
        "definition": "Possessed or influenced by a demon; extremely evil or frenzied; a person believed to be possessed by a demon.",
        "hindi_meaning": "पिशाच जैसा, राक्षसी",
        "mnemonic": "Demoniac sounds like 'demon-like,' indicating something or someone extremely evil or frenzied.",
        "visual_representation": "Picture someone with wild eyes and a frenzied expression, symbolizing a demoniac appearance.",
        "example_sentence": "The demoniac laughter of the villain sent chills down the spines of the characters in the movie."
    },
    {
        "word": "Engross",
        "part_of_speech": "Verb",
        "definition": "To absorb all the attention or interest of someone.",
        "hindi_meaning": "पूरी तरह ध्यान लगाना, मग्न होना",
        "mnemonic": "Engross sounds like 'en-gross,' as in being grossly involved or fully absorbed.",
        "visual_representation": "Picture someone reading a book so intently that they are unaware of their surroundings, symbolizing engrossment.",
        "example_sentence": "The novel was so captivating that it engrossed me for hours."
    },
    {
        "word": "Flit",
        "part_of_speech": "Verb",
        "definition": "To move swiftly and lightly.",
        "hindi_meaning": "इधर-उधर उड़ना, फुदकना",
        "mnemonic": "Flit sounds like 'fleet,' indicating a quick and light movement.",
        "visual_representation": "Imagine a butterfly flitting from flower to flower, symbolizing light, swift movement.",
        "example_sentence": "The bird flitted from branch to branch, barely pausing for a moment."
    },
    {
        "word": "Grapple",
        "part_of_speech": "Verb / Noun",
        "definition": "To struggle or wrestle with something, especially in a physical fight or with a problem; an act of grappling.",
        "hindi_meaning": "जूझना, पकड़ना",
        "mnemonic": "Grapple sounds like 'grip and pull,' indicating a struggle or fight.",
        "visual_representation": "Picture two wrestlers grappling with each other, struggling for control.",
        "example_sentence": "She had to grapple with her fears before stepping on stage."
    },
    {
        "word": "Heckler",
        "part_of_speech": "Noun",
        "definition": "A person who interrupts a performer or public speaker with derisive or aggressive comments or abuse.",
        "hindi_meaning": "सवालों से परेशान करने वाला, तंग करने वाला",
        "mnemonic": "Heckler sounds like 'heckle her,' as in someone shouting or interrupting rudely.",
        "visual_representation": "Picture someone in an audience shouting insults at a speaker, symbolizing a heckler.",
        "example_sentence": "The comedian skillfully handled the heckler who kept interrupting his performance."
    },
    {
        "word": "Inalienable",
        "part_of_speech": "Adjective",
        "definition": "Unable to be taken away from or given away by the possessor.",
        "hindi_meaning": "अविच्छेद्य, अहरणीय",
        "mnemonic": "Inalienable sounds like 'in-alien-able,' meaning something that cannot be alienated or separated.",
        "visual_representation": "Picture a person holding tightly to a document labeled 'Rights,' symbolizing inalienable rights.",
        "example_sentence": "Freedom of speech is an inalienable right in many democracies."
    },
    {
        "word": "Ludicrous",
        "part_of_speech": "Adjective",
        "definition": "So foolish, unreasonable, or out of place as to be amusing; ridiculous.",
        "hindi_meaning": "हास्यास्पद, बेहूदा",
        "mnemonic": "Ludicrous sounds like 'laugh at us,' indicating something so ridiculous that it’s laughable.",
        "visual_representation": "Picture someone wearing a clown suit at a formal event, symbolizing something ludicrous.",
        "example_sentence": "The idea that the Earth is flat is ludicrous in light of all the scientific evidence."
    },
    {
        "word": "Metamorphosis",
        "part_of_speech": "Noun",
        "definition": "A change of the form or nature of a thing or person into a completely different one, by natural or supernatural means.",
        "hindi_meaning": "कायापलट, रूपांतरण",
        "mnemonic": "Metamorphosis sounds like 'meta-more-faces,' indicating a complete transformation.",
        "visual_representation": "Imagine a caterpillar transforming into a butterfly, symbolizing metamorphosis.",
        "example_sentence": "The metamorphosis of the company from a small startup to a tech giant was remarkable."
    },
    {
        "word": "Nostalgia",
        "part_of_speech": "Noun",
        "definition": "A sentimental longing or wistful affection for the past, typically for a period or place with happy personal associations.",
        "hindi_meaning": "अतीत की याद, पुरानी यादें",
        "mnemonic": "Nostalgia sounds like 'nostril-ia,' as in something that brings back old memories with a familiar scent.",
        "visual_representation": "Picture someone looking at old photos and smiling, lost in memories, symbolizing nostalgia.",
        "example_sentence": "The smell of freshly baked bread filled her with nostalgia for her childhood."
    },
    {
        "word": "Outskirts",
        "part_of_speech": "Noun",
        "definition": "The outer parts of a town or city.",
        "hindi_meaning": "बाहरी इलाके, उपनगर",
        "mnemonic": "Outskirts sounds like 'out skirts,' indicating the areas on the edge or outside of the main area.",
        "visual_representation": "Picture the outer edges of a city, with less dense buildings and more open space, symbolizing the outskirts.",
        "example_sentence": "They moved to the outskirts of the city to escape the hustle and bustle of downtown."
    },
    {
        "word": "Pensive",
        "part_of_speech": "Adjective",
        "definition": "Engaged in, involving, or reflecting deep or serious thought.",
        "hindi_meaning": "विचारमग्न, गहन विचारशील",
        "mnemonic": "Pensive sounds like 'penned-sive,' as if someone is writing down deep thoughts.",
        "visual_representation": "Picture someone sitting quietly by a window, lost in thought, symbolizing a pensive mood.",
        "example_sentence": "He was in a pensive mood, reflecting on the events of the past year."
    },
    {
        "word": "Rejoinder",
        "part_of_speech": "Noun",
        "definition": "A reply, especially a sharp or witty one.",
        "hindi_meaning": "प्रत्युत्तर, उत्तर देना",
        "mnemonic": "Rejoinder sounds like 're-join-her,' as in coming back with a quick response.",
        "visual_representation": "Imagine someone giving a quick, clever response in a conversation, symbolizing a rejoinder.",
        "example_sentence": "Her sharp rejoinder left everyone in the room speechless."
    },
    {
        "word": "Sequester",
        "part_of_speech": "Verb",
        "definition": "To isolate or hide away someone or something; to take legal possession of assets until a debt has been paid or other claims have been met.",
        "hindi_meaning": "अलग करना, एकांत में रखना",
        "mnemonic": "Sequester sounds like 'secure rest,' as in isolating someone or something to keep it secure.",
        "visual_representation": "Picture someone being placed in a quiet, isolated room, symbolizing sequestering.",
        "example_sentence": "The jury was sequestered in a hotel during the trial to prevent them from being influenced by the media."
    },
    {
        "word": "Touchstone",
        "part_of_speech": "Noun",
        "definition": "A standard or criterion by which something is judged or recognized.",
        "hindi_meaning": "कसौटी, मानक",
        "mnemonic": "Touchstone sounds like 'touch stone,' as if testing something by touch to check its quality.",
        "visual_representation": "Imagine a goldsmith testing the purity of gold by rubbing it against a touchstone, symbolizing a standard of judgment.",
        "example_sentence": "Her performance in the championship became the touchstone for future athletes."
    },
    {
        "word": "Upbraid",
        "part_of_speech": "Verb",
        "definition": "To find fault with someone; to scold or criticize severely.",
        "hindi_meaning": "डांटना, फटकारना",
        "mnemonic": "Upbraid sounds like 'upbraid her,' as in scolding or criticizing someone.",
        "visual_representation": "Picture a parent sternly scolding a child for misbehavior, symbolizing upbraiding.",
        "example_sentence": "The teacher upbraided the student for not turning in the assignment on time."
    },
    {
        "word": "Voluble",
        "part_of_speech": "Adjective",
        "definition": "Speaking or spoken incessantly and fluently.",
        "hindi_meaning": "वाचाल, बातूनी",
        "mnemonic": "Voluble sounds like 'volume-able,' as in someone who speaks with a lot of words or volume.",
        "visual_representation": "Imagine someone talking rapidly and at length, hardly pausing for breath, symbolizing volubility.",
        "example_sentence": "The voluble salesman convinced many customers to buy the product."
    },
    {
        "word": "Wan",
        "part_of_speech": "Adjective",
        "definition": "(Of a person's complexion or appearance) pale and giving the impression of illness or exhaustion.",
        "hindi_meaning": "पीला, रोगी सा",
        "mnemonic": "Wan sounds like 'waning,' indicating a fading or weak appearance.",
        "visual_representation": "Picture someone with a pale, tired face, looking unwell, symbolizing a wan appearance.",
        "example_sentence": "She appeared wan and tired after several sleepless nights."
    }
]
