[
    {
        "word": "Acrid",
        "part_of_speech": "Adjective",
        "definition": "Having an irritatingly strong and unpleasant taste or smell; angry and bitter.",
        "hindi_meaning": "तीखा, कटु",
        "mnemonic": "Acrid sounds like 'acid,' which has a sharp, bitter taste or smell.",
        "visual_representation": "Imagine the smell of burning rubber, which is sharp and unpleasant, symbolizing something acrid.",
        "example_sentence": "The acrid smoke from the factory made it difficult to breathe."
    },
    {
        "word": "Besmirch",
        "part_of_speech": "Verb",
        "definition": "To damage the reputation of someone or something in the opinion of others; to make dirty or discolored.",
        "hindi_meaning": "कलंकित करना, बदनाम करना",
        "mnemonic": "Besmirch sounds like 'be smirk,' as if someone smirks while tarnishing another’s reputation.",
        "visual_representation": "Picture someone throwing mud at a white shirt, symbolizing the act of besmirching someone's character.",
        "example_sentence": "The scandal was used to besmirch the politician’s clean image."
    },
    {
        "word": "Cavalcade",
        "part_of_speech": "Noun",
        "definition": "A formal procession of people walking, on horseback, or riding in vehicles.",
        "hindi_meaning": "घुड़सवारों या गाड़ियों की शोभायात्रा",
        "mnemonic": "Cavalcade sounds like 'cavalry parade,' indicating a procession or parade.",
        "visual_representation": "Imagine a grand parade with horses and decorated vehicles moving down the street, symbolizing a cavalcade.",
        "example_sentence": "The royal cavalcade proceeded through the city streets, greeted by cheering crowds."
    },
    {
        "word": "Delineate",
        "part_of_speech": "Verb",
        "definition": "To describe or portray something precisely; to indicate the exact position of a border or boundary.",
        "hindi_meaning": "रेखांकित करना, स्पष्ट वर्णन करना",
        "mnemonic": "Delineate sounds like 'draw a line at,' which means to outline or describe clearly.",
        "visual_representation": "Picture someone drawing a clear boundary on a map, symbolizing precise description or delineation.",
        "example_sentence": "The architect delineated the blueprint of the building with great detail."
    },
    {
        "word": "Encroachment",
        "part_of_speech": "Noun",
        "definition": "The act of gradually intruding on a person’s territory or rights.",
        "hindi_meaning": "अतिक्रमण, अधिकार हनन",
        "mnemonic": "Encroachment sounds like 'enter coach,' as if someone is entering or intruding where they shouldn’t.",
        "visual_representation": "Imagine a fence slowly moving into someone else's property, symbolizing encroachment.",
        "example_sentence": "The neighbor’s fence was an encroachment on their property line, leading to a dispute."
    },
    {
        "word": "Flag",
        "part_of_speech": "Verb / Noun",
        "definition": "To mark something for attention or to become tired or weak; a piece of cloth, typically rectangular, representing a country or institution.",
        "hindi_meaning": "थक जाना, झंडा",
        "mnemonic": "Flag as a verb can be remembered as 'flagging energy,' where someone’s energy droops like a flag.",
        "visual_representation": "Imagine a flag slowly drooping as the wind dies down, symbolizing someone becoming tired.",
        "example_sentence": "Her enthusiasm began to flag after hours of hard work."
    },
    {
        "word": "Gorge",
        "part_of_speech": "Noun / Verb",
        "definition": "A narrow valley between hills or mountains, typically with steep rocky walls and a stream running through it; to eat a large amount greedily.",
        "hindi_meaning": "संकीर्ण घाटी, पेट भर खाना",
        "mnemonic": "Gorge sounds like 'gore-edge,' representing the deep edges of a valley or overeating until you're full.",
        "visual_representation": "Picture a deep, narrow canyon with a river flowing through it, symbolizing a gorge.",
        "example_sentence": "The hikers marveled at the stunning views of the gorge from the cliff's edge."
    },
    {
        "word": "Hydrophobia",
        "part_of_speech": "Noun",
        "definition": "An extreme or irrational fear of water, especially as a symptom of rabies in humans.",
        "hindi_meaning": "जल-भय, रैबीज रोग में पानी से डर",
        "mnemonic": "Hydrophobia combines 'hydro' (water) and 'phobia' (fear), indicating a fear of water.",
        "visual_representation": "Imagine someone recoiling in fear at the sight of water, symbolizing hydrophobia.",
        "example_sentence": "The man’s hydrophobia was a symptom of the rabies infection he had contracted."
    },
    {
        "word": "Impotent",
        "part_of_speech": "Adjective",
        "definition": "Unable to take effective action; helpless or powerless.",
        "hindi_meaning": "शक्तिहीन, असमर्थ",
        "mnemonic": "Impotent sounds like 'important but not potent,' meaning powerless.",
        "visual_representation": "Picture someone trying to lift a heavy weight but failing, symbolizing impotence.",
        "example_sentence": "The government seemed impotent in the face of the economic crisis."
    },
    {
        "word": "Loathe",
        "part_of_speech": "Verb",
        "definition": "To feel intense dislike or disgust for something.",
        "hindi_meaning": "घृणा करना, नफरत करना",
        "mnemonic": "Loathe sounds like 'loathe-ful,' indicating something full of hate or disgust.",
        "visual_representation": "Imagine someone turning away in disgust from something repulsive, symbolizing loathing.",
        "example_sentence": "She loathed the idea of waking up early on weekends."
    },
    {
        "word": "Membrane",
        "part_of_speech": "Noun",
        "definition": "A thin, pliable layer of tissue covering surfaces or separating regions, organs, or structures in an organism.",
        "hindi_meaning": "झिल्ली, परत",
        "mnemonic": "Membrane sounds like 'mem-brain,' like the thin layer surrounding the brain.",
        "visual_representation": "Picture a thin, transparent film covering an organ, symbolizing a membrane.",
        "example_sentence": "The cell membrane controls the passage of substances in and out of the cell."
    },
    {
        "word": "Nurture",
        "part_of_speech": "Verb / Noun",
        "definition": "To care for and encourage the growth or development of; the process of caring for and encouraging the growth or development of someone or something.",
        "hindi_meaning": "पोषण करना, पालन-पोषण",
        "mnemonic": "Nurture sounds like 'nurse-ture,' as in a nurse caring for someone’s growth.",
        "visual_representation": "Imagine a gardener carefully tending to a young plant, symbolizing nurturing.",
        "example_sentence": "Parents play a crucial role in nurturing their children’s talents."
    },
    {
        "word": "Ornate",
        "part_of_speech": "Adjective",
        "definition": "Made in an intricate shape or decorated with complex patterns.",
        "hindi_meaning": "अलंकृत, सुसज्जित",
        "mnemonic": "Ornate sounds like 'or-nate,' indicating something decorated with intricate details.",
        "visual_representation": "Picture an elaborately decorated chandelier with intricate patterns, symbolizing something ornate.",
        "example_sentence": "The ornate carvings on the temple walls were breathtaking."
    },
    {
        "word": "Pecuniary",
        "part_of_speech": "Adjective",
        "definition": "Relating to or consisting of money.",
        "hindi_meaning": "धन संबंधी, वित्तीय",
        "mnemonic": "Pecuniary sounds like 'penny-carey,' indicating something related to money or financial matters.",
        "visual_representation": "Picture a stack of coins and bills, symbolizing something pecuniary.",
        "example_sentence": "The court’s decision had serious pecuniary implications for the company."
    },
    {
        "word": "Refraction",
        "part_of_speech": "Noun",
        "definition": "The bending of light as it passes from one medium to another with different density.",
        "hindi_meaning": "अपवर्तन, प्रकाश का मुड़ना",
        "mnemonic": "Refraction sounds like 're-fraction,' where light changes direction as it passes through different mediums.",
        "visual_representation": "Picture a straw appearing bent in a glass of water, symbolizing light refraction.",
        "example_sentence": "The refraction of light through the prism created a rainbow of colors."
    },
    {
        "word": "Sedentary",
        "part_of_speech": "Adjective",
        "definition": "Characterized by much sitting and little physical exercise.",
        "hindi_meaning": "बैठा रहने वाला, निष्क्रिय",
        "mnemonic": "Sedentary sounds like 'sit-dentary,' indicating a lifestyle involving a lot of sitting.",
        "visual_representation": "Imagine someone sitting at a desk all day without moving, symbolizing a sedentary lifestyle.",
        "example_sentence": "A sedentary lifestyle can lead to health problems such as obesity and heart disease."
    },
    {
        "word": "Titter",
        "part_of_speech": "Verb / Noun",
        "definition": "To give a short, half-suppressed laugh; a suppressed giggle.",
        "hindi_meaning": "दबी हुई हंसी, मंद-मंद हंसना",
        "mnemonic": "Titter sounds like 'teeter,' as in a light, suppressed laugh that might teeter out.",
        "visual_representation": "Picture a group of people giggling quietly in the back of a classroom, symbolizing a titter.",
        "example_sentence": "The audience tittered nervously at the comedian’s risqué joke."
    },
    {
        "word": "Unscathed",
        "part_of_speech": "Adjective",
        "definition": "Without suffering any injury, damage, or harm.",
        "hindi_meaning": "अक्षत, बिना चोट खाए",
        "mnemonic": "Unscathed sounds like 'un-scalded,' indicating not being harmed or burned.",
        "visual_representation": "Picture someone walking away from a car accident without a scratch, symbolizing being unscathed.",
        "example_sentence": "Miraculously, she emerged from the accident unscathed."
    },
    {
        "word": "Viscid",
        "part_of_speech": "Adjective",
        "definition": "Having a thick, sticky consistency; viscous.",
        "hindi_meaning": "चिपचिपा, गाढ़ा",
        "mnemonic": "Viscid sounds like 'viciously stick,' indicating something that sticks and is hard to remove.",
        "visual_representation": "Picture thick honey slowly dripping off a spoon, symbolizing a viscid substance.",
        "example_sentence": "The viscid sap oozed from the tree trunk, making it difficult to remove."
    },
    {
        "word": "Withstand",
        "part_of_speech": "Verb",
        "definition": "To remain undamaged or unaffected by; to resist.",
        "hindi_meaning": "सहन करना, विरोध करना",
        "mnemonic": "Withstand sounds like 'stand with,' indicating standing firm against something.",
        "visual_representation": "Picture a strong tree standing firm against a powerful storm, symbolizing resistance or withstanding.",
        "example_sentence": "The building was designed to withstand earthquakes."
    }
]
