[
    {
        "word": "Acumen",
        "part_of_speech": "Noun",
        "definition": "The ability to make good judgments and quick decisions, typically in a particular domain.",
        "hindi_meaning": "सूझबूझ, तीव्रता",
        "mnemonic": "Acumen sounds like 'accurate men,' someone who is sharp and makes good decisions.",
        "visual_representation": "Picture a sharp-minded businessman making a quick, smart decision in a meeting, symbolizing acumen.",
        "example_sentence": "Her financial acumen helped the company grow rapidly in a short period."
    },
    {
        "word": "Bevy",
        "part_of_s_speech": "Noun",
        "definition": "A large group of people or things of a particular kind.",
        "hindi_meaning": "झुंड, समूह",
        "mnemonic": "Bevy sounds like 'bunch of,' indicating a large group or collection.",
        "visual_representation": "Imagine a group of birds flying together in a formation, symbolizing a bevy.",
        "example_sentence": "A bevy of tourists gathered around the famous monument."
    },
    {
        "word": "Celestial",
        "part_of_speech": "Adjective",
        "definition": "Positioned in or relating to the sky, or outer space as observed in astronomy; heavenly or divine.",
        "hindi_meaning": "आकाशीय, स्वर्गीय",
        "mnemonic": "Celestial sounds like 'celeste,' which refers to the heavens or the sky.",
        "visual_representation": "Picture a night sky filled with stars and planets, symbolizing something celestial.",
        "example_sentence": "The comet was a spectacular celestial event visible across the entire hemisphere."
    },
    {
        "word": "Demagogue",
        "part_of_speech": "Noun",
        "definition": "A political leader who seeks support by appealing to the desires and prejudices of ordinary people rather than by using rational argument.",
        "hindi_meaning": "भावुक नेता, जननेता",
        "mnemonic": "Demagogue sounds like 'demo-gag,' as in a leader who uses emotional appeals to gag the opposition.",
        "visual_representation": "Imagine a politician giving a fiery speech, stirring up emotions rather than presenting logical arguments.",
        "example_sentence": "The demagogue exploited public fears to gain political power."
    },
    {
        "word": "Energize",
        "part_of_speech": "Verb",
        "definition": "To give vitality and enthusiasm to someone; to activate or set in motion.",
        "hindi_meaning": "ऊर्जा देना, सक्रिय करना",
        "mnemonic": "Energize sounds like 'energy rise,' indicating an increase in energy or motivation.",
        "visual_representation": "Picture someone drinking a cup of coffee and suddenly feeling more alert and active, symbolizing being energized.",
        "example_sentence": "The motivational speaker energized the audience with his powerful words."
    },
    {
        "word": "Fledgling",
        "part_of_speech": "Noun / Adjective",
        "definition": "A young bird that has just fledged; a person or organization that is immature, inexperienced, or underdeveloped.",
        "hindi_meaning": "नवजात, अनुभवहीन व्यक्ति",
        "mnemonic": "Fledgling sounds like 'freshling,' indicating something new or inexperienced.",
        "visual_representation": "Imagine a young bird taking its first flight from the nest, symbolizing a fledgling.",
        "example_sentence": "The fledgling company is still finding its footing in the competitive market."
    },
    {
        "word": "Graft",
        "part_of_speech": "Noun / Verb",
        "definition": "The illegal or unfair acquisition of money, especially through corruption; a piece of living tissue that is transplanted surgically.",
        "hindi_meaning": "भ्रष्टाचार, ऊतक प्रत्यारोपण",
        "mnemonic": "Graft sounds like 'grabbed,' indicating something taken illegally or through corruption.",
        "visual_representation": "Picture a corrupt official taking a bribe, symbolizing graft.",
        "example_sentence": "The investigation uncovered widespread graft within the government."
    },
    {
        "word": "Haggard",
        "part_of_speech": "Adjective",
        "definition": "Looking exhausted and unwell, especially from fatigue, worry, or suffering.",
        "hindi_meaning": "थका हुआ, चिंताग्रस्त",
        "mnemonic": "Haggard sounds like 'hard guard,' someone who has been guarding too hard, looking worn out.",
        "visual_representation": "Imagine someone with dark circles under their eyes, unkempt hair, and a tired expression, symbolizing haggardness.",
        "example_sentence": "After working for three days straight without sleep, he looked haggard and pale."
    },
    {
        "word": "Improvise",
        "part_of_speech": "Verb",
        "definition": "To create and perform spontaneously or without preparation; to make something from whatever is available.",
        "hindi_meaning": "तत्काल बनाना, बिना तैयारी के करना",
        "mnemonic": "Improvise sounds like 'improve wise,' where you wisely create something on the spot.",
        "visual_representation": "Picture a musician playing a tune without sheet music, creating it as they go along, symbolizing improvisation.",
        "example_sentence": "When the actor forgot his lines, he had to improvise to keep the scene going."
    },
    {
        "word": "Loom",
        "part_of_speech": "Verb / Noun",
        "definition": "To appear as a large, often frightening or unclear shape or object; a textile machine for weaving.",
        "hindi_meaning": "उभरना, कपड़ा बुनने की मशीन",
        "mnemonic": "Loom sounds like 'looming large,' indicating something that appears ominously large.",
        "visual_representation": "Imagine a large shadowy figure suddenly appearing on the horizon, symbolizing something looming.",
        "example_sentence": "The storm clouds loomed on the horizon, threatening to spoil the picnic."
    },
    {
        "word": "Mentor",
        "part_of_speech": "Noun / Verb",
        "definition": "An experienced and trusted advisor; to advise or train someone, especially a younger colleague.",
        "hindi_meaning": "मार्गदर्शक, सलाह देना",
        "mnemonic": "Mentor sounds like 'men-tutor,' someone who tutors or guides others.",
        "visual_representation": "Picture an older person giving advice to a younger one, symbolizing mentorship.",
        "example_sentence": "She has been a great mentor to many young professionals in the industry."
    },
    {
        "word": "Noncommittal",
        "part_of_speech": "Adjective",
        "definition": "Not expressing or revealing commitment to a definite opinion or course of action.",
        "hindi_meaning": "अनिश्चित, अस्पष्ट",
        "mnemonic": "Noncommittal sounds like 'non-commit,' indicating someone who is not committing to a decision.",
        "visual_representation": "Imagine someone shrugging their shoulders when asked for their opinion, symbolizing being noncommittal.",
        "example_sentence": "His noncommittal response left everyone unsure of where he stood on the issue."
    },
    {
        "word": "Ostensible",
        "part_of_speech": "Adjective",
        "definition": "Stated or appearing to be true, but not necessarily so.",
        "hindi_meaning": "प्रकट, दिखावटी",
        "mnemonic": "Ostensible sounds like 'ostentatious,' meaning something that appears true but may not be.",
        "visual_representation": "Picture someone putting on a brave face but hiding their true feelings, symbolizing something ostensible.",
        "example_sentence": "The ostensible reason for the meeting was to discuss the budget, but other issues were also addressed."
    },
    {
        "word": "Peerless",
        "part_of_speech": "Adjective",
        "definition": "Unequaled; unrivaled.",
        "hindi_meaning": "अद्वितीय, बेजोड़",
        "mnemonic": "Peerless sounds like 'peer-less,' indicating no one is equal or comparable to this person or thing.",
        "visual_representation": "Picture an athlete standing alone on a podium, far ahead of all competition, symbolizing peerlessness.",
        "example_sentence": "Her peerless performance in the tournament earned her the title of champion."
    },
    {
        "word": "Regale",
        "part_of_speech": "Verb",
        "definition": "To entertain or amuse someone with talk or storytelling; to lavishly supply (someone) with food or drink.",
        "hindi_meaning": "आनंदित करना, दावत देना",
        "mnemonic": "Regale sounds like 'regal,' indicating something grand or entertaining.",
        "visual_representation": "Imagine a storyteller captivating an audience with an exciting tale, symbolizing regaling.",
        "example_sentence": "He regaled us with tales of his adventures in the jungle."
    },
    {
        "word": "Seethe",
        "part_of_speech": "Verb",
        "definition": "To be filled with intense but unexpressed anger; to bubble up as a result of being boiled.",
        "hindi_meaning": "उबलना, अंदर से गुस्से में होना",
        "mnemonic": "Seethe sounds like 'see the,' as in seeing the anger boil up inside someone.",
        "visual_representation": "Picture a pot of water bubbling and boiling over, symbolizing seething anger.",
        "example_sentence": "She was seething with rage but managed to keep her composure."
    },
    {
        "word": "Torpor",
        "part_of_speech": "Noun",
        "definition": "A state of physical or mental inactivity; lethargy.",
        "hindi_meaning": "सुस्ती, जड़ता",
        "mnemonic": "Torpor sounds like 'torpedo,' but instead of moving fast, it’s like being immobilized or inactive.",
        "visual_representation": "Imagine someone lying on a couch, too tired to move or do anything, symbolizing torpor.",
        "example_sentence": "After the long hike, a feeling of torpor overtook them, and they rested in the shade."
    },
    {
        "word": "Unconscionable",
        "part_of_speech": "Adjective",
        "definition": "Not right or reasonable; unreasonably excessive.",
        "hindi_meaning": "अनुचित, अति अनुचित",
        "mnemonic": "Unconscionable sounds like 'un-conscience-able,' meaning something that goes against a reasonable conscience.",
        "visual_representation": "Picture a greedy landlord charging an unconscionable rent that tenants can’t afford.",
        "example_sentence": "The company’s unconscionable actions led to widespread public outrage."
    },
    {
        "word": "Vituperative",
        "part_of_speech": "Adjective",
        "definition": "Bitter and abusive in language or tone.",
        "hindi_meaning": "अपमानजनक, कटु",
        "mnemonic": "Vituperative sounds like 'viper,' indicating a venomous or harsh manner of speaking.",
        "visual_representation": "Imagine someone shouting harsh, hurtful words, symbolizing a vituperative tone.",
        "example_sentence": "The debate turned vituperative as the candidates exchanged personal insults."
    },
    {
        "word": "Waylay",
        "part_of_speech": "Verb",
        "definition": "To stop or interrupt someone and detain them in conversation or trouble them in some other way.",
        "hindi_meaning": "घात लगाना, रास्ते में रोकना",
        "mnemonic": "Waylay sounds like 'lay in the way,' meaning to ambush or stop someone on their way.",
        "visual_representation": "Picture a group of robbers hiding by the roadside, ready to ambush travelers, symbolizing waylaying.",
        "example_sentence": "The journalist was waylaid by protesters on his way to the press conference."
    }
]
