[
    {
        "word": "Advocate",
        "part_of_speech": "Noun / Verb",
        "definition": "A person who publicly supports or recommends a particular cause or policy; to publicly recommend or support.",
        "hindi_meaning": "समर्थक, वकालत करना",
        "mnemonic": "Advocate sounds like 'add-vocate,' indicating someone who adds their voice in support of something.",
        "visual_representation": "Picture a lawyer passionately defending their client in court, symbolizing advocacy.",
        "example_sentence": "She is a strong advocate for animal rights and regularly participates in protests."
    },
    {
        "word": "Blurt",
        "part_of_sech": "Verb",
        "definition": "To say something suddenly and without careful consideration.",
        "hindi_meaning": "बिना सोचे-समझे बोलना, उगल देना",
        "mnemonic": "Blurt sounds like 'blow out,' indicating words that come out suddenly, often by mistake.",
        "visual_representation": "Imagine someone accidentally shouting out a secret in the middle of a quiet room, symbolizing a blurt.",
        "example_sentence": "He couldn’t help but blurt out the surprise, ruining the party."
    },
    {
        "word": "Chassis",
        "part_of_speech": "Noun",
        "definition": "The base frame of a motor vehicle or other wheeled conveyance.",
        "hindi_meaning": "चेसिस, वाहन का ढांचा",
        "mnemonic": "Chassis sounds like 'cha-sis,' indicating the structural framework of a vehicle.",
        "visual_representation": "Picture the bare frame of a car without the body, showing the underlying chassis.",
        "example_sentence": "The mechanic inspected the car’s chassis for any signs of damage."
    },
    {
        "word": "Derelict",
        "part_of_speech": "Adjective / Noun",
        "definition": "In a very poor condition as a result of disuse and neglect; a person without a home, job, or property.",
        "hindi_meaning": "उपेक्षित, लावारिस",
        "mnemonic": "Derelict sounds like 'dare-licked,' as if something has been left to deteriorate and decay.",
        "visual_representation": "Picture an abandoned, crumbling building covered in vines, symbolizing something derelict.",
        "example_sentence": "The derelict house had been abandoned for years and was falling apart."
    },
    {
        "word": "Entrepreneur",
        "part_of_speech": "Noun",
        "definition": "A person who organizes and operates a business or businesses, taking on greater than normal financial risks in order to do so.",
        "hindi_meaning": "उद्यमी, व्यवसायी",
        "mnemonic": "Entrepreneur sounds like 'enter-preneur,' indicating someone who enters into new ventures.",
        "visual_representation": "Picture a businessperson starting a new company from scratch, symbolizing entrepreneurship.",
        "example_sentence": "The young entrepreneur started her own tech company at the age of 23."
    },
    {
        "word": "Forbearance",
        "part_of_speech": "Noun",
        "definition": "Patient self-control; restraint and tolerance.",
        "hindi_meaning": "धैर्य, सहनशीलता",
        "mnemonic": "Forbearance sounds like 'for-bear-ance,' as in bearing with something or someone with patience.",
        "visual_representation": "Imagine someone calmly waiting while others around them lose their patience, symbolizing forbearance.",
        "example_sentence": "His forbearance in the face of provocation was admirable."
    },
    {
        "word": "Guffaw",
        "part_of_speech": "Noun / Verb",
        "definition": "A loud and boisterous laugh.",
        "hindi_meaning": "ठहाका, जोर से हंसना",
        "mnemonic": "Guffaw sounds like 'laugh-aw,' indicating a loud burst of laughter.",
        "visual_representation": "Picture a group of people bursting into loud, hearty laughter, symbolizing a guffaw.",
        "example_sentence": "His joke was so funny that it elicited a guffaw from the entire room."
    },
    {
        "word": "Heed",
        "part_of_speech": "Verb / Noun",
        "definition": "To pay attention to; take notice of; careful attention.",
        "hindi_meaning": "ध्यान देना, सतर्कता",
        "mnemonic": "Heed sounds like 'hear-ed,' indicating listening carefully or paying attention.",
        "visual_representation": "Imagine someone stopping to carefully read and follow a warning sign, symbolizing heeding advice.",
        "example_sentence": "He should have heeded the warning signs and stayed away from the risky investment."
    },
    {
        "word": "Incite",
        "part_of_speech": "Verb",
        "definition": "To encourage or stir up (violent or unlawful behavior).",
        "hindi_meaning": "उकसाना, भड़काना",
        "mnemonic": "Incite sounds like 'in-sight,' indicating putting something in someone’s sight to provoke action.",
        "visual_representation": "Picture a leader stirring up a crowd to take aggressive action, symbolizing incitement.",
        "example_sentence": "The politician was accused of inciting violence with his inflammatory speech."
    },
    {
        "word": "Lap",
        "part_of_speech": "Noun / Verb",
        "definition": "The flat area between the waist and knees of a seated person; to overtake (a competitor in a race) and thereby lead them by one or more circuits.",
        "hindi_meaning": "गोद, गोद में रखना; दौड़ में एक चक्कर लगाना",
        "mnemonic": "Lap sounds like 'lap' of water or a race, indicating both sitting and overtaking in a circuit.",
        "visual_representation": "Imagine a child sitting comfortably in their parent’s lap or a runner lapping another in a race.",
        "example_sentence": "The child sat in her mother’s lap during the storytime."
    },
    {
        "word": "Mirth",
        "part_of_speech": "Noun",
        "definition": "Amusement, especially as expressed in laughter.",
        "hindi_meaning": "हंसी, उल्लास",
        "mnemonic": "Mirth sounds like 'merry-earth,' indicating a world full of laughter and joy.",
        "visual_representation": "Picture a room full of people laughing and enjoying each other’s company, symbolizing mirth.",
        "example_sentence": "The party was filled with mirth and laughter, making it a memorable evening."
    },
    {
        "word": "Omniscient",
        "part_of_speech": "Adjective",
        "definition": "Knowing everything; having unlimited understanding or knowledge.",
        "hindi_meaning": "सर्वज्ञ, सब कुछ जानने वाला",
        "mnemonic": "Omniscient sounds like 'omni-scient,' indicating all-knowing or fully knowledgeable.",
        "visual_representation": "Imagine a wise, all-knowing figure like a deity or philosopher, symbolizing omniscience.",
        "example_sentence": "The narrator in the novel is omniscient, providing insights into all the characters’ thoughts."
    },
    {
        "word": "Perpetuate",
        "part_of_speech": "Verb",
        "definition": "To make something continue indefinitely; to preserve from extinction.",
        "hindi_meaning": "बनाए रखना, कायम रखना",
        "mnemonic": "Perpetuate sounds like 'per-pet-uate,' as if keeping a pet forever, indicating making something last.",
        "visual_representation": "Picture a candle that never burns out, symbolizing perpetuation.",
        "example_sentence": "The charity aims to perpetuate the memory of the founder by continuing his work."
    },
    {
        "word": "Renegade",
        "part_of_speech": "Noun / Adjective",
        "definition": "A person who deserts and betrays an organization, country, or set of principles; having treacherously changed allegiance.",
        "hindi_meaning": "गद्दार, दलबदलू",
        "mnemonic": "Renegade sounds like 'run-against,' indicating someone who goes against or betrays.",
        "visual_representation": "Picture someone leaving a group and turning against their former allies, symbolizing a renegade.",
        "example_sentence": "The renegade soldier was captured after attempting to betray his comrades."
    },
    {
        "word": "Shroud",
        "part_of_speech": "Noun / Verb",
        "definition": "A length of cloth or an enveloping garment in which a dead person is wrapped for burial; to cover or envelop so as to conceal from view.",
        "hindi_meaning": "कफन, ढंकना",
        "mnemonic": "Shroud sounds like 'cloud,' which can cover or obscure something, much like a shroud.",
        "visual_representation": "Imagine a body wrapped in a white cloth for burial, symbolizing a shroud.",
        "example_sentence": "The mist shrouded the mountain, making it invisible from afar."
    },
    {
        "word": "Traumatic",
        "part_of_speech": "Adjective",
        "definition": "Emotionally disturbing or distressing; relating to or causing psychological trauma.",
        "hindi_meaning": "आघातकारी, हानिकारक",
        "mnemonic": "Traumatic sounds like 'trauma,' indicating something that causes deep emotional distress.",
        "visual_representation": "Picture someone experiencing a shocking event, leaving them visibly shaken, symbolizing trauma.",
        "example_sentence": "The accident was so traumatic that she had nightmares for weeks."
    },
    {
        "word": "Urbane",
        "part_of_speech": "Adjective",
        "definition": "(Of a person, especially a man) courteous and refined in manner.",
        "hindi_meaning": "शिष्ट, सौम्य",
        "mnemonic": "Urbane sounds like 'urban,' indicating someone with the polished manners often associated with city life.",
        "visual_representation": "Imagine a well-dressed gentleman at a formal event, symbolizing urbane behavior.",
        "example_sentence": "The urbane host greeted each guest with a warm smile and impeccable manners."
    },
    {
        "word": "Vernacular",
        "part_of_speech": "Noun / Adjective",
        "definition": "The language or dialect spoken by the ordinary people in a particular country or region; spoken as one’s mother tongue.",
        "hindi_meaning": "बोली, स्थानीय भाषा",
        "mnemonic": "Vernacular sounds like 'verbal-cular,' indicating everyday spoken language.",
        "visual_representation": "Picture people in a local market speaking in their native dialect, symbolizing vernacular language.",
        "example_sentence": "The novel is written in the vernacular, making it more relatable to the local audience."
    },
    {
        "word": "Wither",
        "part_of_speech": "Verb",
        "definition": "(Of a plant) to become dry and shriveled; to cause harm or damage to something.",
        "hindi_meaning": "मुरझाना, सूख जाना",
        "mnemonic": "Wither sounds like 'wither away,' indicating something slowly dying or losing vitality.",
        "visual_representation": "Imagine a once vibrant flower wilting and drying up, symbolizing withering.",
        "example_sentence": "The flowers began to wither after being left in the sun without water."
    }
]
