[
    {
        "word": "Admonish",
        "part_of_speech": "Verb",
        "definition": "To warn or reprimand someone firmly; to advise or urge earnestly.",
        "hindi_meaning": "चेतावनी देना, डांटना",
        "mnemonic": "Admonish sounds like 'add-mon-ish,' as if adding a firm warning or advice.",
        "visual_representation": "Picture a parent sternly advising their child not to repeat a mistake, symbolizing admonishment.",
        "example_sentence": "The teacher admonished the students for talking during the exam."
    },
    {
        "word": "Blare",
        "part_of_speech": "Verb / Noun",
        "definition": "To make a loud, harsh noise; a loud, harsh sound.",
        "hindi_meaning": "कानफोड़ू आवाज़, ज़ोर से बजाना",
        "mnemonic": "Blare sounds like 'blow air,' indicating a loud, harsh noise, like a horn blowing.",
        "visual_representation": "Imagine a car horn blaring loudly in traffic, symbolizing a blare.",
        "example_sentence": "The sirens blared in the distance, warning everyone of the approaching storm."
    },
    {
        "word": "Cession",
        "part_of_speech": "Noun",
        "definition": "The formal giving up of rights, property, or territory by a state.",
        "hindi_meaning": "समर्पण, अधिकार त्याग",
        "mnemonic": "Cession sounds like 'cession of land,' indicating the formal giving up of land or rights.",
        "visual_representation": "Picture a country formally signing over a piece of land to another nation, symbolizing cession.",
        "example_sentence": "The cession of the territory to the neighboring country was part of the peace agreement."
    },
    {
        "word": "Denounce",
        "part_of_speech": "Verb",
        "definition": "To publicly declare to be wrong or evil; to criticize harshly and publicly.",
        "hindi_meaning": "निंदा करना, दोषारोपण करना",
        "mnemonic": "Denounce sounds like 'announce against,' indicating a public declaration against something.",
        "visual_representation": "Imagine a public figure speaking out against corruption, symbolizing denouncement.",
        "example_sentence": "The politician denounced the unethical practices of his opponents."
    },
    {
        "word": "Ensconce",
        "part_of_speech": "Verb",
        "definition": "To settle someone in a comfortable, safe, or secret place.",
        "hindi_meaning": "सुरक्षित स्थान पर रखना, बसाना",
        "mnemonic": "Ensconce sounds like 'in-sconce,' as if placing something securely inside a comfortable spot.",
        "visual_representation": "Picture someone settling into a cozy armchair by the fireplace, symbolizing ensconcing.",
        "example_sentence": "She ensconced herself in the corner of the library with a good book."
    },
    {
        "word": "Fluency",
        "part_of_speech": "Noun",
        "definition": "The ability to express oneself easily and articulately; the ability to speak or write a foreign language easily and accurately.",
        "hindi_meaning": "प्रवाह, धाराप्रवाह",
        "mnemonic": "Fluency sounds like 'flow-ency,' indicating a smooth, flowing ability to speak or write.",
        "visual_representation": "Imagine someone speaking a language smoothly without hesitation, symbolizing fluency.",
        "example_sentence": "Her fluency in French impressed everyone at the conference."
    },
    {
        "word": "Grill",
        "part_of_speech": "Verb / Noun",
        "definition": "To cook food using direct heat; to question someone intensely and thoroughly.",
        "hindi_meaning": "आग पर भूनना, कड़ी पूछताछ करना",
        "mnemonic": "Grill sounds like 'grill someone,' as in putting someone under intense heat or questioning.",
        "visual_representation": "Picture someone being questioned by detectives under a bright light, symbolizing grilling.",
        "example_sentence": "The police grilled the suspect for hours to get a confession."
    },
    {
        "word": "Homage",
        "part_of_speech": "Noun",
        "definition": "Special honor or respect shown publicly.",
        "hindi_meaning": "श्रद्धांजलि, सम्मान",
        "mnemonic": "Homage sounds like 'home-age,' as in paying respect to something or someone important from the past.",
        "visual_representation": "Picture a statue with flowers laid at its base, symbolizing homage.",
        "example_sentence": "The community paid homage to the soldiers who lost their lives in the war."
    },
    {
        "word": "Incarcerate",
        "part_of_speech": "Verb",
        "definition": "To imprison or confine someone.",
        "hindi_meaning": "कैद करना, जेल में डालना",
        "mnemonic": "Incarcerate sounds like 'in-car-cerate,' as in putting someone into a cell or car to take them to jail.",
        "visual_representation": "Imagine a prisoner being locked behind bars, symbolizing incarceration.",
        "example_sentence": "The criminal was incarcerated for his role in the robbery."
    },
    {
        "word": "Lunar",
        "part_of_speech": "Adjective",
        "definition": "Relating to the moon.",
        "hindi_meaning": "चंद्रमा का, चंद्र संबंधी",
        "mnemonic": "Lunar sounds like 'luna,' which is Latin for moon, indicating something related to the moon.",
        "visual_representation": "Picture a bright, full moon in the night sky, symbolizing something lunar.",
        "example_sentence": "The lunar eclipse was visible from many parts of the world."
    },
    {
        "word": "Microcosm",
        "part_of_speech": "Noun",
        "definition": "A community, place, or situation regarded as encapsulating in miniature the characteristics of something much larger.",
        "hindi_meaning": "सूक्ष्म जगत, छोटे रूप में संसार",
        "mnemonic": "Microcosm sounds like 'micro-cosm,' indicating a small version of the larger world (cosmos).",
        "visual_representation": "Imagine a tiny model of a city, representing the larger city, symbolizing a microcosm.",
        "example_sentence": "The classroom was a microcosm of the larger society, with students from diverse backgrounds."
    },
    {
        "word": "Notoriety",
        "part_of_speech": "Noun",
        "definition": "The state of being famous or well-known for some bad quality or deed.",
        "hindi_meaning": "बदनामी, कुख्याति",
        "mnemonic": "Notoriety sounds like 'notorious,' indicating being well-known, often for something negative.",
        "visual_representation": "Picture a criminal’s face on a wanted poster, symbolizing notoriety.",
        "example_sentence": "The scandal brought her notoriety, making her a household name for all the wrong reasons."
    },
    {
        "word": "Obdurate",
        "part_of_speech": "Adjective",
        "definition": "Stubbornly refusing to change one's opinion or course of action.",
        "hindi_meaning": "हठी, कठोर",
        "mnemonic": "Obdurate sounds like 'ob-durable,' indicating someone who is tough and unyielding in their opinions.",
        "visual_representation": "Imagine someone with their arms crossed, refusing to listen or change their mind, symbolizing obduracy.",
        "example_sentence": "Despite the protests, the leader remained obdurate in his decision."
    },
    {
        "word": "Perfidious",
        "part_of_speech": "Adjective",
        "definition": "Deceitful and untrustworthy.",
        "hindi_meaning": "विश्वासघाती, धोखेबाज",
        "mnemonic": "Perfidious sounds like 'per-fraud-ious,' indicating someone who is deceitful and not to be trusted.",
        "visual_representation": "Picture someone shaking hands while crossing their fingers behind their back, symbolizing perfidy.",
        "example_sentence": "He was betrayed by his perfidious friend, who revealed all his secrets."
    },
    {
        "word": "Remediable",
        "part_of_speech": "Adjective",
        "definition": "Capable of being corrected or cured.",
        "hindi_meaning": "उपचार योग्य, ठीक किया जा सकता है",
        "mnemonic": "Remediable sounds like 'remedy-able,' indicating something that can be fixed or cured with a remedy.",
        "visual_representation": "Picture a doctor holding medicine that can cure an illness, symbolizing something remediable.",
        "example_sentence": "The problem was remediable with proper treatment and care."
    },
    {
        "word": "Shackle",
        "part_of_speech": "Verb / Noun",
        "definition": "To chain or restrain someone, typically with shackles; a pair of fetters connected together by a chain, used to fasten a prisoner's wrists or ankles together.",
        "hindi_meaning": "बेड़ी, जंजीर",
        "mnemonic": "Shackle sounds like 'shake-ill,' as if being chained or restrained so tightly that you can barely move.",
        "visual_representation": "Imagine a prisoner with heavy chains around their ankles, unable to move freely, symbolizing shackling.",
        "example_sentence": "The prisoner’s hands were shackled to prevent him from escaping."
    },
    {
        "word": "Tranquillity",
        "part_of_speech": "Noun",
        "definition": "The quality or state of being calm and peaceful.",
        "hindi_meaning": "शांति, सुकून",
        "mnemonic": "Tranquillity sounds like 'tranquil,' which means calm and peaceful.",
        "visual_representation": "Picture a serene lake with no ripples, surrounded by trees, symbolizing tranquillity.",
        "example_sentence": "She enjoyed the tranquillity of the early morning before the city woke up."
    },
    {
        "word": "Unrequited",
        "part_of_speech": "Adjective",
        "definition": "(Of a feeling, especially love) not returned or rewarded.",
        "hindi_meaning": "प्रतिफलहीन, अनुत्तरित",
        "mnemonic": "Unrequited sounds like 'un-requited,' indicating something not reciprocated or returned.",
        "visual_representation": "Imagine someone sending a love letter that goes unanswered, symbolizing unrequited love.",
        "example_sentence": "His unrequited love for her left him heartbroken."
    },
    {
        "word": "Vagabond",
        "part_of_speech": "Noun / Adjective",
        "definition": "A person who wanders from place to place without a home or job; having no settled home.",
        "hindi_meaning": "आवारा, भटकता हुआ",
        "mnemonic": "Vagabond sounds like 'vague-bond,' indicating someone who roams without a clear purpose or place.",
        "visual_representation": "Picture a person with a backpack, wandering along a road with no fixed destination, symbolizing a vagabond.",
        "example_sentence": "The vagabond traveled from town to town, never staying in one place for long."
    },
    {
        "word": "Warrant",
        "part_of_speech": "Noun / Verb",
        "definition": "A document issued by a legal or government official authorizing the police to make an arrest, search premises, or carry out some other action; to justify or necessitate a certain course of action.",
        "hindi_meaning": "वारंट, अधिकार पत्र",
        "mnemonic": "Warrant sounds like 'warrant officer,' indicating something officially authorized or justified.",
        "visual_representation": "Picture a police officer holding a warrant that authorizes a search, symbolizing an official warrant.",
        "example_sentence": "The judge issued a warrant for the suspect’s arrest after new evidence was presented."
    }
]
