[
    {
        "word": "Advent",
        "part_of_speech": "Noun",
        "definition": "The arrival of a notable person, thing, or event.",
        "hindi_meaning": "आगमन, प्रकट होना",
        "mnemonic": "Advent sounds like 'advent calendar,' which counts down to the arrival of Christmas, symbolizing the arrival of something significant.",
        "visual_representation": "Picture a sunrise symbolizing the advent of a new day.",
        "example_sentence": "The advent of the internet revolutionized communication worldwide."
    },
    {
        "word": "Blithe",
        "part_of_speech": "Adjective",
        "definition": "Showing a casual and cheerful indifference considered to be callous or improper; happy or carefree.",
        "hindi_meaning": "मस्त, बेफिक्र",
        "mnemonic": "Blithe sounds like 'bliss,' indicating a happy and carefree attitude.",
        "visual_representation": "Imagine someone walking in a park, whistling and carefree, symbolizing a blithe spirit.",
        "example_sentence": "She had a blithe disregard for the rules, doing as she pleased."
    },
    {
        "word": "Chameleon",
        "part_of_speech": "Noun",
        "definition": "A small lizard known for its ability to change color to match its surroundings; a person who changes their opinions or behavior according to the situation.",
        "hindi_meaning": "गिरगिट, रंग बदलने वाला",
        "mnemonic": "Chameleon sounds like 'camel-lion,' an animal that can change its appearance, symbolizing adaptability.",
        "visual_representation": "Picture a chameleon blending into the leaves, symbolizing adaptability.",
        "example_sentence": "Politicians are often compared to chameleons, changing their stance to suit the audience."
    },
    {
        "word": "Deposition",
        "part_of_speech": "Noun",
        "definition": "The process of giving sworn evidence; the act of deposing someone, especially a monarch.",
        "hindi_meaning": "गवाही, पदच्युति",
        "mnemonic": "Deposition sounds like 'deposit-ion,' as in depositing testimony in a court, or the removal of someone from power.",
        "visual_representation": "Imagine a witness in a courtroom giving testimony, symbolizing a deposition.",
        "example_sentence": "The deposition of the witness was crucial in the trial."
    },
    {
        "word": "Entitlement",
        "part_of_speech": "Noun",
        "definition": "The belief that one is inherently deserving of privileges or special treatment; the fact of having a right to something.",
        "hindi_meaning": "अधिकार, हक़दारी",
        "mnemonic": "Entitlement sounds like 'entitle-ment,' indicating a sense of deserving or having a right to something.",
        "visual_representation": "Picture someone holding a certificate that declares their right to a benefit, symbolizing entitlement.",
        "example_sentence": "His sense of entitlement made him difficult to work with, as he always expected special treatment."
    },
    {
        "word": "Foil",
        "part_of_speech": "Verb / Noun",
        "definition": "To prevent the success of something; to frustrate or thwart; a person or thing that contrasts with and so emphasizes and enhances the qualities of another.",
        "hindi_meaning": "विफल करना, रुकावट",
        "mnemonic": "Foil sounds like 'spoil,' indicating stopping or hindering something.",
        "visual_representation": "Imagine a superhero foiling a villain’s plan, symbolizing thwarting.",
        "example_sentence": "The detective foiled the criminal’s plot to rob the bank."
    },
    {
        "word": "Grovel",
        "part_of_speech": "Verb",
        "definition": "To act in an obsequious manner in order to obtain someone's forgiveness or favor; to lie or crawl abjectly on the ground with one's face downward.",
        "hindi_meaning": "दासवत व्यवहार करना, गिड़गिड़ाना",
        "mnemonic": "Grovel sounds like 'gravel,' as in crawling or lowering oneself on the ground.",
        "visual_representation": "Picture someone bowing low and begging for forgiveness, symbolizing groveling.",
        "example_sentence": "He groveled at his boss’s feet, desperate to keep his job."
    },
    {
        "word": "Hybrid",
        "part_of_speech": "Noun / Adjective",
        "definition": "A thing made by combining two different elements; a mixture; bred from two distinct breeds, varieties, species, or genera.",
        "hindi_meaning": "मिश्रित, संकर",
        "mnemonic": "Hybrid sounds like 'hi-breed,' indicating a combination of different breeds or elements.",
        "visual_representation": "Picture a car that runs on both electricity and gasoline, symbolizing a hybrid.",
        "example_sentence": "The hybrid car is more fuel-efficient than traditional models."
    },
    {
        "word": "Incessant",
        "part_of_speech": "Adjective",
        "definition": "(Of something regarded as unpleasant) continuing without pause or interruption.",
        "hindi_meaning": "निरंतर, बिना रुके",
        "mnemonic": "Incessant sounds like 'in-say-sent,' as in something continuously sent or happening without pause.",
        "visual_representation": "Imagine a faucet that won’t stop dripping, symbolizing incessant action.",
        "example_sentence": "The incessant noise from the construction site made it impossible to concentrate."
    },
    {
        "word": "Lustrous",
        "part_of_speech": "Adjective",
        "definition": "Having luster; shining.",
        "hindi_meaning": "चमकीला, चमकदार",
        "mnemonic": "Lustrous sounds like 'lust-reus,' indicating something shining or glowing with a soft light.",
        "visual_representation": "Picture a strand of shiny, silky hair glowing under the light, symbolizing lustrous quality.",
        "example_sentence": "Her lustrous hair gleamed in the sunlight."
    },
    {
        "word": "Mincing",
        "part_of_speech": "Adjective",
        "definition": "(Of a man’s or woman's manner or speech) affectedly dainty or refined.",
        "hindi_meaning": "बनावटी, नाज़ुक",
        "mnemonic": "Mincing sounds like 'mini-sing,' as if someone is walking or talking in a small, affected manner.",
        "visual_representation": "Picture someone walking with tiny, delicate steps, symbolizing a mincing manner.",
        "example_sentence": "She spoke in a mincing tone, trying to appear more refined than she was."
    },
    {
        "word": "Nip",
        "part_of_speech": "Verb / Noun",
        "definition": "To pinch, squeeze, or bite sharply; a small drink of alcohol.",
        "hindi_meaning": "काटना, चुटकी भरना",
        "mnemonic": "Nip sounds like 'tip,' as in a small pinch or bite, or a tiny drink.",
        "visual_representation": "Imagine a small dog nipping at someone’s heels, symbolizing a sharp, quick bite.",
        "example_sentence": "The cold wind nipped at her cheeks as she walked outside."
    },
    {
        "word": "Obstinate",
        "part_of_speech": "Adjective",
        "definition": "Stubbornly refusing to change one’s opinion or chosen course of action, despite attempts to persuade one to do so.",
        "hindi_meaning": "हठी, जिद्दी",
        "mnemonic": "Obstinate sounds like 'obstacle-innate,' as if being stubborn is a natural obstacle in one’s character.",
        "visual_representation": "Picture a mule refusing to move no matter how hard someone tries to pull it, symbolizing obstinacy.",
        "example_sentence": "The obstinate child refused to eat his vegetables despite his parents’ pleas."
    },
    {
        "word": "Perjury",
        "part_of_speech": "Noun",
        "definition": "The offense of willfully telling an untruth or making a misrepresentation under oath.",
        "hindi_meaning": "झूठी गवाही, कसम तोड़ना",
        "mnemonic": "Perjury sounds like 'per-jury,' as if lying during a jury trial.",
        "visual_representation": "Imagine a witness in court lying while under oath, symbolizing perjury.",
        "example_sentence": "The witness was convicted of perjury after being caught lying on the stand."
    },
    {
        "word": "Remonstrance",
        "part_of_speech": "Noun",
        "definition": "A forcefully reproachful protest.",
        "hindi_meaning": "विरोध, आपत्ति",
        "mnemonic": "Remonstrance sounds like 're-monstrate,' as if demonstrating against something again, forcefully.",
        "visual_representation": "Picture a group of people protesting loudly with signs and chants, symbolizing remonstrance.",
        "example_sentence": "The employees’ remonstrance against the new policy was ignored by the management."
    },
    {
        "word": "Sheathe",
        "part_of_speech": "Verb",
        "definition": "To put a weapon, such as a sword, into a sheath; to encase something in a protective covering.",
        "hindi_meaning": "म्यान में रखना, ढकना",
        "mnemonic": "Sheathe sounds like 'sheath,' indicating putting something into a cover or protective case.",
        "visual_representation": "Picture a sword being placed back into its sheath, symbolizing sheathing.",
        "example_sentence": "After the battle, the knight sheathed his sword and rode back to the castle."
    },
    {
        "word": "Transitory",
        "part_of_speech": "Adjective",
        "definition": "Not permanent; temporary.",
        "hindi_meaning": "क्षणिक, अस्थायी",
        "mnemonic": "Transitory sounds like 'transit-story,' indicating something that is passing or temporary.",
        "visual_representation": "Imagine a passing cloud that momentarily covers the sun, symbolizing something transitory.",
        "example_sentence": "The transitory nature of youth is often reflected in literature."
    },
    {
        "word": "Universal",
        "part_of_speech": "Adjective",
        "definition": "Relating to or done by all people or things in the world or in a particular group; applicable to all cases.",
        "hindi_meaning": "सार्वभौमिक, सर्वव्यापी",
        "mnemonic": "Universal sounds like 'universe-all,' indicating something that applies to everyone or everything.",
        "visual_representation": "Picture a globe symbolizing the entire world, representing something universal.",
        "example_sentence": "The desire for happiness is a universal human trait."
    },
    {
        "word": "Veneer",
        "part_of_speech": "Noun / Verb",
        "definition": "A thin decorative covering of fine wood applied to a coarser wood or other material; an attractive appearance that covers or disguises someone or something’s true nature or feelings.",
        "hindi_meaning": "चमक, नकली आवरण",
        "mnemonic": "Veneer sounds like 'veneer,' indicating a superficial or thin covering.",
        "visual_representation": "Picture a piece of cheap furniture covered with a thin layer of fine wood, symbolizing veneer.",
        "example_sentence": "The politician’s friendly demeanor was just a veneer hiding his ruthless ambition."
    },
    {
        "word": "Woe",
        "part_of_speech": "Noun",
        "definition": "Great sorrow or distress.",
        "hindi_meaning": "दुख, पीड़ा",
        "mnemonic": "Woe sounds like 'whoa,' as in an expression of sorrow or grief.",
        "visual_representation": "Imagine a person sitting with their head in their hands, deeply sorrowful, symbolizing woe.",
        "example_sentence": "She shared her tales of woe with her friends, seeking comfort and advice."
    }
]
